<abi-corpus version='2.0' path='/home/runner/work/plotjuggler_core/plotjuggler_core/build/pj_plugins/libmock_data_source_plugin.so' architecture='elf-amd-x86_64' soname='libmock_data_source_plugin.so'>
  <elf-needed>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PJ_get_data_source_vtable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN2PJ13errorToStringB5cxx11ERK10PJ_error_t' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN2PJ20DataSourcePluginBase10loadConfigB5cxx11ESt17basic_string_viewIcSt11char_traitsIcEE' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN2PJ20DataSourcePluginBase15pluginExtensionESt17basic_string_viewIcSt11char_traitsIcEE' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN2PJ20DataSourcePluginBase15trampoline_bindEPv21PJ_service_registry_tP10PJ_error_t' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN2PJ20DataSourcePluginBase15trampoline_pollEPvP10PJ_error_t' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZNSt8__detail9__variant17__gen_vtable_implINS0_12_Multi_arrayIPFvOZNS0_16_Variant_storageILb0EJN2PJ3sdk19SourceWriteHostViewENS4_8ExpectedIS6_NSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE12ErrorStorageEEE8_M_resetEvEUlOT_E_RSt7variantIJS6_SF_EEEJEEESt16integer_sequenceImJLm0EEEE14__visit_invokeESK_SN_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt8__detail9__variant17__gen_vtable_implINS0_12_Multi_arrayIPFvOZNS0_16_Variant_storageILb0EJN2PJ3sdk19SourceWriteHostViewENS4_8ExpectedIS6_NSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE12ErrorStorageEEE8_M_resetEvEUlOT_E_RSt7variantIJS6_SF_EEEJEEESt16integer_sequenceImJLm1EEEE14__visit_invokeESK_SN_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZSt26__throw_bad_variant_accessPKc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZSt26__throw_bad_variant_accessb' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZStplIcSt11char_traitsIcESaIcEENSt7__cxx1112basic_stringIT_T0_T1_EEOS8_PKS5_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZNSt8__detail9__variant12__gen_vtableINS0_21__deduce_visit_resultIN2PJ13PrimitiveTypeEEEOZNS3_3sdk6typeOfERKSt7variantIJNS3_9NullValueENS6_9TypedNullEfdasilhtjmbSt17basic_string_viewIcSt11char_traitsIcEEEEEUlOT_E_JSG_EE9_S_vtableE' size='112' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt8__detail9__variant12__gen_vtableINS0_21__deduce_visit_resultIvEEOZN2PJ3sdk11toAbiScalarERKSt7variantIJNS4_9NullValueENS5_9TypedNullEfdasilhtjmbSt17basic_string_viewIcSt11char_traitsIcEEEEEUlOT_E_JSF_EE9_S_vtableE' size='112' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt8__detail9__variant12__gen_vtableIvOZNS0_16_Variant_storageILb0EJ17PJ_topic_handle_tN2PJ8ExpectedIS3_NSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE12ErrorStorageEEE8_M_resetEvEUlOT_E_JRSt7variantIJS3_SD_EEEE9_S_vtableE' size='16' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt8__detail9__variant12__gen_vtableIvOZNS0_16_Variant_storageILb0EJ26PJ_parser_binding_handle_tN2PJ8ExpectedIS3_NSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE12ErrorStorageEEE8_M_resetEvEUlOT_E_JRSt7variantIJS3_SD_EEEE9_S_vtableE' size='16' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt8__detail9__variant12__gen_vtableIvOZNS0_16_Variant_storageILb0EJN2PJ25DataSourceRuntimeHostViewENS3_8ExpectedIS4_NSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE12ErrorStorageEEE8_M_resetEvEUlOT_E_JRSt7variantIJS4_SD_EEEE9_S_vtableE' size='16' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt8__detail9__variant12__gen_vtableIvOZNS0_16_Variant_storageILb0EJN2PJ3sdk19SourceWriteHostViewENS3_8ExpectedIS5_NSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE12ErrorStorageEEE8_M_resetEvEUlOT_E_JRSt7variantIJS5_SE_EEEE9_S_vtableE' size='16' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN2PJ20DataSourcePluginBaseE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTISt18bad_variant_access' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN2PJ20DataSourcePluginBaseE' size='28' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSSt18bad_variant_access' size='23' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN2PJ20DataSourcePluginBaseE' size='128' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVSt18bad_variant_access' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pj_plugin_abi_version' size='4' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='/home/runner/work/plotjuggler_core/plotjuggler_core/pj_plugins/examples/mock_data_source.cpp' comp-dir-path='/home/runner/work/plotjuggler_core/plotjuggler_core/build' language='LANG_C_plus_plus_14'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='128' id='type-id-3'>
      <subrange length='16' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-6'>
      <subrange length='1' type-id='type-id-4' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='160' id='type-id-8'>
      <subrange length='20' type-id='type-id-4' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='1792' id='type-id-10'>
      <subrange length='224' type-id='type-id-4' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='256' id='type-id-12'>
      <subrange length='32' type-id='type-id-4' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32' id='type-id-14'>
      <subrange length='4' type-id='type-id-4' id='type-id-15'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-18' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-19'/>
    <type-decl name='float' size-in-bits='32' id='type-id-20'/>
    <type-decl name='int' size-in-bits='32' id='type-id-21'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-22'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-24'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-25'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-26'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-27'/>
    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='896' id='type-id-29'>
      <subrange length='14' type-id='type-id-4' id='type-id-30'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='896' id='type-id-32'>
      <subrange length='14' type-id='type-id-4' id='type-id-30'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='128' id='type-id-34'>
      <subrange length='2' type-id='type-id-4' id='type-id-35'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-36' size-in-bits='128' id='type-id-37'>
      <subrange length='2' type-id='type-id-4' id='type-id-35'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='128' id='type-id-39'>
      <subrange length='2' type-id='type-id-4' id='type-id-35'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-40' size-in-bits='128' id='type-id-41'>
      <subrange length='2' type-id='type-id-4' id='type-id-35'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-42'/>
    <type-decl name='unnamed-enum-underlying-type-8' is-anonymous='yes' size-in-bits='8' alignment-in-bits='8' id='type-id-43'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-44'/>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='256' id='type-id-45'>
      <subrange length='32' type-id='type-id-4' id='type-id-13'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-17'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-46'/>
    <type-decl name='variadic parameter type' id='type-id-47'/>
    <type-decl name='void' id='type-id-48'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-49'/>
    <enum-decl name='PJ_data_source_state_t' naming-typedef-id='type-id-50' linkage-name='22PJ_data_source_state_t' id='type-id-51'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_IDLE' value='0'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_CONFIGURING' value='1'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_STARTING' value='2'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_RUNNING' value='3'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_PAUSED' value='4'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_STOPPING' value='5'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_STOPPED' value='6'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_FAILED' value='7'/>
      <enumerator name='PJ_DATA_SOURCE_STATE_FORCE_INT32' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='PJ_data_source_state_t' type-id='type-id-51' id='type-id-50'/>
    <enum-decl name='PJ_data_source_message_level_t' naming-typedef-id='type-id-52' linkage-name='30PJ_data_source_message_level_t' id='type-id-53'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='PJ_DATA_SOURCE_MESSAGE_INFO' value='0'/>
      <enumerator name='PJ_DATA_SOURCE_MESSAGE_WARNING' value='1'/>
      <enumerator name='PJ_DATA_SOURCE_MESSAGE_ERROR' value='2'/>
      <enumerator name='PJ_DATA_SOURCE_MESSAGE_FORCE_INT32' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='PJ_data_source_message_level_t' type-id='type-id-53' id='type-id-52'/>
    <enum-decl name='PJ_message_box_type_t' naming-typedef-id='type-id-54' linkage-name='21PJ_message_box_type_t' id='type-id-55'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='PJ_MESSAGE_BOX_INFO' value='0'/>
      <enumerator name='PJ_MESSAGE_BOX_WARNING' value='1'/>
      <enumerator name='PJ_MESSAGE_BOX_ERROR' value='2'/>
      <enumerator name='PJ_MESSAGE_BOX_QUESTION' value='3'/>
      <enumerator name='PJ_MESSAGE_BOX_TYPE_FORCE_INT32' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='PJ_message_box_type_t' type-id='type-id-55' id='type-id-54'/>
    <class-decl name='PJ_parser_binding_handle_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-56' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_parser_binding_handle_t' type-id='type-id-57' id='type-id-56'/>
    <class-decl name='PJ_payload_anchor_t' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='release' type-id='type-id-60' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_payload_anchor_t' type-id='type-id-59' id='type-id-61'/>
    <class-decl name='PJ_payload_t' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='anchor' type-id='type-id-61' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_payload_t' type-id='type-id-62' id='type-id-65'/>
    <class-decl name='PJ_message_data_fetcher_t' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fetchMessageData' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='release' type-id='type-id-60' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_message_data_fetcher_t' type-id='type-id-66' id='type-id-68'/>
    <class-decl name='PJ_parser_binding_request_t' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-69' visibility='default' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='topic_name' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='parser_encoding' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='type_name' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='schema' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parser_config_json' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_parser_binding_request_t' type-id='type-id-70' id='type-id-69'/>
    <class-decl name='PJ_data_source_runtime_host_vtable_t' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol_version' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='struct_size' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='report_message' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='progress_start' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='progress_update' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='progress_finish' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='is_stop_requested' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='notify_state' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='request_stop' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ensure_parser_binding' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='push_raw_message' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='show_message_box' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='list_available_encodings' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='push_message_v2' type-id='type-id-84' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_data_source_runtime_host_vtable_t' type-id='type-id-73' id='type-id-85'/>
    <class-decl name='PJ_data_source_runtime_host_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-86' visibility='default' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vtable' type-id='type-id-88' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_data_source_runtime_host_t' type-id='type-id-87' id='type-id-86'/>
    <class-decl name='PJ_data_source_vtable_t' size-in-bits='1024' is-struct='yes' visibility='default' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol_version' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='struct_size' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='create' type-id='type-id-90' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='manifest_json' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='capabilities' type-id='type-id-92' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bind' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='save_config' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='load_config' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='start' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='stop' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pause' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resume' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='poll' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='current_state' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='get_dialog' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get_plugin_extension' type-id='type-id-99' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_data_source_vtable_t' type-id='type-id-89' id='type-id-100'/>
    <enum-decl name='PJ_primitive_type_t' naming-typedef-id='type-id-101' linkage-name='19PJ_primitive_type_t' id='type-id-102'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_FLOAT32' value='0'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_FLOAT64' value='1'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_INT8' value='2'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_INT16' value='3'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_INT32' value='4'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_INT64' value='5'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_UINT8' value='6'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_UINT16' value='7'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_UINT32' value='8'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_UINT64' value='9'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_BOOL' value='10'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_STRING' value='11'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_UNSPECIFIED' value='255'/>
      <enumerator name='PJ_PRIMITIVE_TYPE_FORCE_INT32' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='PJ_primitive_type_t' type-id='type-id-102' id='type-id-101'/>
    <class-decl name='PJ_string_view_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-71' visibility='default' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_string_view_t' type-id='type-id-103' id='type-id-71'/>
    <class-decl name='PJ_bytes_view_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-72' visibility='default' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_bytes_view_t' type-id='type-id-104' id='type-id-72'/>
    <class-decl name='ArrowSchema' size-in-bits='576' is-struct='yes' visibility='default' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='metadata' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='n_children' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='children' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dictionary' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='release' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='private_data' type-id='type-id-18' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ArrowArray' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='null_count' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='n_buffers' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='n_children' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buffers' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='children' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dictionary' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='release' type-id='type-id-114' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='private_data' type-id='type-id-18' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ArrowArrayStream' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='get_schema' type-id='type-id-116' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_next' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_last_error' type-id='type-id-118' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='release' type-id='type-id-119' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='private_data' type-id='type-id-18' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PJ_topic_handle_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-120' visibility='default' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_topic_handle_t' type-id='type-id-121' id='type-id-120'/>
    <class-decl name='PJ_field_handle_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-122' visibility='default' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='topic' type-id='type-id-120' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='id' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_field_handle_t' type-id='type-id-123' id='type-id-122'/>
    <class-decl name='PJ_object_topic_handle_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-124' visibility='default' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_object_topic_handle_t' type-id='type-id-125' id='type-id-124'/>
    <class-decl name='PJ_error_t' size-in-bits='2432' is-struct='yes' naming-typedef-id='type-id-126' visibility='default' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='domain' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='message' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='extended' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='extended_kind' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_error_t' type-id='type-id-127' id='type-id-126'/>
    <class-decl name='PJ_service_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-129' visibility='default' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vtable' type-id='type-id-18' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_service_t' type-id='type-id-130' id='type-id-129'/>
    <class-decl name='PJ_service_registry_vtable_t' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol_version' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='struct_size' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_service' type-id='type-id-132' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_service_registry_vtable_t' type-id='type-id-131' id='type-id-133'/>
    <class-decl name='PJ_service_registry_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-134' visibility='default' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vtable' type-id='type-id-136' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_service_registry_t' type-id='type-id-135' id='type-id-134'/>
    <class-decl name='PJ_borrowed_dialog_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-137' visibility='default' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vtable' type-id='type-id-139' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_borrowed_dialog_t' type-id='type-id-138' id='type-id-137'/>
    <union-decl name='PJ_scalar_value_data_t' size-in-bits='128' naming-typedef-id='type-id-140' visibility='default' id='type-id-141'>
      <data-member access='public'>
        <var-decl name='as_float32' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_float64' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_int8' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_int16' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_int32' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_int64' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_uint8' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_uint16' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_uint32' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_uint64' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_bool' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_string' type-id='type-id-71' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='PJ_scalar_value_data_t' type-id='type-id-141' id='type-id-140'/>
    <class-decl name='PJ_scalar_value_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-146' visibility='default' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_scalar_value_t' type-id='type-id-147' id='type-id-146'/>
    <class-decl name='PJ_named_field_value_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-148' visibility='default' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_null' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value' type-id='type-id-146' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_named_field_value_t' type-id='type-id-149' id='type-id-148'/>
    <class-decl name='PJ_bound_field_value_t' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-150' visibility='default' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='field' type-id='type-id-122' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='is_null' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-146' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_bound_field_value_t' type-id='type-id-151' id='type-id-150'/>
    <class-decl name='PJ_source_write_host_vtable_t' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='abi_version' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='struct_size' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ensure_topic' type-id='type-id-153' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ensure_field' type-id='type-id-154' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='append_record' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='append_bound_record' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='append_arrow_stream' type-id='type-id-157' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_source_write_host_vtable_t' type-id='type-id-152' id='type-id-158'/>
    <class-decl name='PJ_source_write_host_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-159' visibility='default' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vtable' type-id='type-id-161' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_source_write_host_t' type-id='type-id-160' id='type-id-159'/>
    <typedef-decl name='PJ_lazy_fetch_fn_t' type-id='type-id-162' id='type-id-163'/>
    <class-decl name='PJ_object_write_host_vtable_t' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='abi_version' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='struct_size' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='register_topic' type-id='type-id-165' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='push_owned' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='push_lazy' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='set_retention_budget' type-id='type-id-168' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_object_write_host_vtable_t' type-id='type-id-164' id='type-id-169'/>
    <class-decl name='PJ_object_write_host_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-170' visibility='default' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vtable' type-id='type-id-172' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PJ_object_write_host_t' type-id='type-id-171' id='type-id-170'/>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-175' id='type-id-176'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-21' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-178' id='type-id-177'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-179' visibility='default' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-180' id='type-id-179'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-181' visibility='default' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-24' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-182' id='type-id-181'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-183' id='type-id-184'/>
    <typedef-decl name='wctrans_t' type-id='type-id-185' id='type-id-186'/>
    <typedef-decl name='int8_t' type-id='type-id-187' id='type-id-142'/>
    <typedef-decl name='int16_t' type-id='type-id-188' id='type-id-143'/>
    <typedef-decl name='int32_t' type-id='type-id-189' id='type-id-128'/>
    <typedef-decl name='int64_t' type-id='type-id-190' id='type-id-106'/>
    <typedef-decl name='uint8_t' type-id='type-id-191' id='type-id-144'/>
    <typedef-decl name='uint16_t' type-id='type-id-192' id='type-id-145'/>
    <typedef-decl name='uint32_t' type-id='type-id-193' id='type-id-58'/>
    <typedef-decl name='uint64_t' type-id='type-id-194' id='type-id-64'/>
    <typedef-decl name='__int8_t' type-id='type-id-27' id='type-id-187'/>
    <typedef-decl name='__uint8_t' type-id='type-id-44' id='type-id-191'/>
    <typedef-decl name='__int16_t' type-id='type-id-26' id='type-id-188'/>
    <typedef-decl name='__uint16_t' type-id='type-id-46' id='type-id-192'/>
    <typedef-decl name='__int32_t' type-id='type-id-21' id='type-id-189'/>
    <typedef-decl name='__uint32_t' type-id='type-id-17' id='type-id-193'/>
    <typedef-decl name='__int64_t' type-id='type-id-23' id='type-id-190'/>
    <typedef-decl name='__uint64_t' type-id='type-id-4' id='type-id-194'/>
    <typedef-decl name='__off_t' type-id='type-id-23' id='type-id-195'/>
    <typedef-decl name='__off64_t' type-id='type-id-23' id='type-id-196'/>
    <typedef-decl name='FILE' type-id='type-id-197' id='type-id-198'/>
    <typedef-decl name='__FILE' type-id='type-id-197' id='type-id-199'/>
    <class-decl name='_G_fpos_t' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-195' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-201' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos_t' type-id='type-id-200' id='type-id-175'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-201' visibility='default' id='type-id-202'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='type-id-203'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-17' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-14' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-203' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-202' id='type-id-201'/>
    <typedef-decl name='mbstate_t' type-id='type-id-201' id='type-id-204'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-48' id='type-id-205'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-195' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-91' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wint_t' type-id='type-id-17' id='type-id-213'/>
    <typedef-decl name='wctype_t' type-id='type-id-4' id='type-id-214'/>
    <typedef-decl name='size_t' type-id='type-id-4' id='type-id-211'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-218'/>
    <reference-type-def kind='lvalue' type-id='type-id-219' size-in-bits='64' id='type-id-220'/>
    <reference-type-def kind='rvalue' type-id='type-id-219' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-222'/>
    <qualified-type-def type-id='type-id-222' const='yes' id='type-id-223'/>
    <reference-type-def kind='lvalue' type-id='type-id-224' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-226'/>
    <qualified-type-def type-id='type-id-226' const='yes' id='type-id-227'/>
    <reference-type-def kind='lvalue' type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <reference-type-def kind='rvalue' type-id='type-id-228' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-231' const='yes' id='type-id-232'/>
    <reference-type-def kind='lvalue' type-id='type-id-233' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-235'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-236'/>
    <reference-type-def kind='lvalue' type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <reference-type-def kind='rvalue' type-id='type-id-237' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-240'/>
    <qualified-type-def type-id='type-id-240' const='yes' id='type-id-241'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <reference-type-def kind='lvalue' type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <reference-type-def kind='rvalue' type-id='type-id-244' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <reference-type-def kind='lvalue' type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <reference-type-def kind='rvalue' type-id='type-id-250' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-256'/>
    <reference-type-def kind='lvalue' type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <reference-type-def kind='rvalue' type-id='type-id-257' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-260'/>
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-261'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <qualified-type-def type-id='type-id-263' const='yes' id='type-id-264'/>
    <reference-type-def kind='lvalue' type-id='type-id-265' size-in-bits='64' id='type-id-266'/>
    <reference-type-def kind='rvalue' type-id='type-id-265' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-268'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-269'/>
    <reference-type-def kind='lvalue' type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-272'/>
    <qualified-type-def type-id='type-id-272' const='yes' id='type-id-273'/>
    <reference-type-def kind='lvalue' type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <reference-type-def kind='rvalue' type-id='type-id-274' size-in-bits='64' id='type-id-276'/>
    <reference-type-def kind='lvalue' type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <reference-type-def kind='rvalue' type-id='type-id-277' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-280'/>
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-281'/>
    <reference-type-def kind='rvalue' type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-286'/>
    <reference-type-def kind='lvalue' type-id='type-id-287' size-in-bits='64' id='type-id-288'/>
    <reference-type-def kind='rvalue' type-id='type-id-287' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-290'/>
    <qualified-type-def type-id='type-id-290' const='yes' id='type-id-291'/>
    <reference-type-def kind='lvalue' type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <reference-type-def kind='rvalue' type-id='type-id-292' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-295'/>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-296'/>
    <reference-type-def kind='lvalue' type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <reference-type-def kind='rvalue' type-id='type-id-297' size-in-bits='64' id='type-id-299'/>
    <reference-type-def kind='lvalue' type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <reference-type-def kind='rvalue' type-id='type-id-300' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-303'/>
    <reference-type-def kind='rvalue' type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-306'/>
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' id='type-id-307'/>
    <reference-type-def kind='rvalue' type-id='type-id-122' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-309'/>
    <reference-type-def kind='lvalue' type-id='type-id-148' size-in-bits='64' id='type-id-310'/>
    <reference-type-def kind='rvalue' type-id='type-id-148' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <reference-type-def kind='lvalue' type-id='type-id-124' size-in-bits='64' id='type-id-315'/>
    <reference-type-def kind='rvalue' type-id='type-id-124' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-317'/>
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' id='type-id-318'/>
    <reference-type-def kind='rvalue' type-id='type-id-56' size-in-bits='64' id='type-id-319'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-321'/>
    <reference-type-def kind='lvalue' type-id='type-id-146' size-in-bits='64' id='type-id-322'/>
    <reference-type-def kind='lvalue' type-id='type-id-129' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-325'/>
    <reference-type-def kind='lvalue' type-id='type-id-120' size-in-bits='64' id='type-id-326'/>
    <reference-type-def kind='rvalue' type-id='type-id-120' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-332'/>
    <reference-type-def kind='lvalue' type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-335'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-336'/>
    <reference-type-def kind='lvalue' type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-339'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-340'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-344'/>
    <reference-type-def kind='lvalue' type-id='type-id-345' size-in-bits='64' id='type-id-346'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' id='type-id-347'/>
    <qualified-type-def type-id='type-id-347' const='yes' id='type-id-348'/>
    <reference-type-def kind='lvalue' type-id='type-id-349' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-351'/>
    <qualified-type-def type-id='type-id-351' const='yes' id='type-id-352'/>
    <reference-type-def kind='lvalue' type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <reference-type-def kind='lvalue' type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-359'/>
    <qualified-type-def type-id='type-id-359' const='yes' id='type-id-360'/>
    <reference-type-def kind='lvalue' type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-363'/>
    <reference-type-def kind='lvalue' type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-366'/>
    <reference-type-def kind='lvalue' type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-369'/>
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-370'/>
    <reference-type-def kind='lvalue' type-id='type-id-371' size-in-bits='64' id='type-id-372'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <qualified-type-def type-id='type-id-375' const='yes' id='type-id-376'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-378'/>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-379'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-76'/>
    <reference-type-def kind='lvalue' type-id='type-id-1' size-in-bits='64' id='type-id-401'/>
    <reference-type-def kind='rvalue' type-id='type-id-1' size-in-bits='64' id='type-id-402'/>
    <reference-type-def kind='lvalue' type-id='type-id-2' size-in-bits='64' id='type-id-403'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-174'/>
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-404'/>
    <reference-type-def kind='lvalue' type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-406'/>
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-407'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-408'/>
    <qualified-type-def type-id='type-id-217' const='yes' id='type-id-409'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-410'/>
    <qualified-type-def type-id='type-id-410' const='yes' id='type-id-411'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-412'/>
    <reference-type-def kind='lvalue' type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <reference-type-def kind='rvalue' type-id='type-id-412' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-415'/>
    <qualified-type-def type-id='type-id-415' const='yes' id='type-id-416'/>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-417'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-418'/>
    <qualified-type-def type-id='type-id-418' const='yes' id='type-id-419'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-420'/>
    <reference-type-def kind='lvalue' type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <reference-type-def kind='rvalue' type-id='type-id-420' size-in-bits='64' id='type-id-422'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-423'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-424'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-425'/>
    <qualified-type-def type-id='type-id-425' const='yes' id='type-id-426'/>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-427'/>
    <reference-type-def kind='lvalue' type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <reference-type-def kind='rvalue' type-id='type-id-427' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-430'/>
    <qualified-type-def type-id='type-id-242' const='yes' id='type-id-431'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-244' const='yes' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-433' size-in-bits='64' id='type-id-434'/>
    <reference-type-def kind='rvalue' type-id='type-id-433' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-248' const='yes' id='type-id-437'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-439'/>
    <reference-type-def kind='lvalue' type-id='type-id-439' size-in-bits='64' id='type-id-440'/>
    <reference-type-def kind='rvalue' type-id='type-id-439' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-254' const='yes' id='type-id-443'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <qualified-type-def type-id='type-id-444' const='yes' id='type-id-445'/>
    <qualified-type-def type-id='type-id-257' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <reference-type-def kind='rvalue' type-id='type-id-446' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-449'/>
    <qualified-type-def type-id='type-id-262' const='yes' id='type-id-450'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-451' const='yes' id='type-id-452'/>
    <qualified-type-def type-id='type-id-265' const='yes' id='type-id-453'/>
    <reference-type-def kind='lvalue' type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <reference-type-def kind='rvalue' type-id='type-id-453' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-456'/>
    <qualified-type-def type-id='type-id-270' const='yes' id='type-id-457'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' id='type-id-458'/>
    <qualified-type-def type-id='type-id-458' const='yes' id='type-id-459'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-460'/>
    <reference-type-def kind='lvalue' type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <reference-type-def kind='rvalue' type-id='type-id-460' size-in-bits='64' id='type-id-462'/>
    <qualified-type-def type-id='type-id-463' const='yes' id='type-id-464'/>
    <reference-type-def kind='lvalue' type-id='type-id-464' size-in-bits='64' id='type-id-465'/>
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-466'/>
    <reference-type-def kind='lvalue' type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-468'/>
    <qualified-type-def type-id='type-id-469' const='yes' id='type-id-470'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <qualified-type-def type-id='type-id-472' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-475'/>
    <qualified-type-def type-id='type-id-475' const='yes' id='type-id-476'/>
    <reference-type-def kind='lvalue' type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-478'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <qualified-type-def type-id='type-id-479' const='yes' id='type-id-480'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-481'/>
    <reference-type-def kind='lvalue' type-id='type-id-481' size-in-bits='64' id='type-id-482'/>
    <reference-type-def kind='rvalue' type-id='type-id-481' size-in-bits='64' id='type-id-483'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-484'/>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-485'/>
    <reference-type-def kind='lvalue' type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <reference-type-def kind='rvalue' type-id='type-id-485' size-in-bits='64' id='type-id-487'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-488'/>
    <qualified-type-def type-id='type-id-488' const='yes' id='type-id-489'/>
    <qualified-type-def type-id='type-id-297' const='yes' id='type-id-490'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' id='type-id-491'/>
    <reference-type-def kind='rvalue' type-id='type-id-490' size-in-bits='64' id='type-id-492'/>
    <qualified-type-def type-id='type-id-493' const='yes' id='type-id-494'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <qualified-type-def type-id='type-id-300' const='yes' id='type-id-496'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-497'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-498'/>
    <qualified-type-def type-id='type-id-150' const='yes' id='type-id-499'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-501'/>
    <reference-type-def kind='lvalue' type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-503'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-88'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-504'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-506' const='yes' id='type-id-507'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-139'/>
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-508'/>
    <reference-type-def kind='lvalue' type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <qualified-type-def type-id='type-id-122' const='yes' id='type-id-510'/>
    <reference-type-def kind='lvalue' type-id='type-id-510' size-in-bits='64' id='type-id-511'/>
    <reference-type-def kind='rvalue' type-id='type-id-510' size-in-bits='64' id='type-id-512'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-513'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-514'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-515'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-516'/>
    <reference-type-def kind='lvalue' type-id='type-id-516' size-in-bits='64' id='type-id-517'/>
    <reference-type-def kind='rvalue' type-id='type-id-516' size-in-bits='64' id='type-id-518'/>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-520'/>
    <reference-type-def kind='lvalue' type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <qualified-type-def type-id='type-id-169' const='yes' id='type-id-522'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-172'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-523'/>
    <reference-type-def kind='lvalue' type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <reference-type-def kind='rvalue' type-id='type-id-523' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-526'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-527'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' id='type-id-528'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-529'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-136'/>
    <qualified-type-def type-id='type-id-129' const='yes' id='type-id-530'/>
    <reference-type-def kind='lvalue' type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-532'/>
    <reference-type-def kind='lvalue' type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-534'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-161'/>
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-535'/>
    <reference-type-def kind='lvalue' type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <reference-type-def kind='rvalue' type-id='type-id-535' size-in-bits='64' id='type-id-537'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-333' const='yes' id='type-id-539'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-541'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <qualified-type-def type-id='type-id-341' const='yes' id='type-id-543'/>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' id='type-id-544'/>
    <qualified-type-def type-id='type-id-343' const='yes' id='type-id-545'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-546'/>
    <qualified-type-def type-id='type-id-345' const='yes' id='type-id-547'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-549'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-551'/>
    <reference-type-def kind='lvalue' type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-558' const='yes' id='type-id-559'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-560'/>
    <qualified-type-def type-id='type-id-561' const='yes' id='type-id-562'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-564' const='yes' id='type-id-565'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-566'/>
    <qualified-type-def type-id='type-id-357' const='yes' id='type-id-567'/>
    <reference-type-def kind='lvalue' type-id='type-id-567' size-in-bits='64' id='type-id-568'/>
    <pointer-type-def type-id='type-id-567' size-in-bits='64' id='type-id-569'/>
    <qualified-type-def type-id='type-id-569' const='yes' id='type-id-570'/>
    <qualified-type-def type-id='type-id-361' const='yes' id='type-id-571'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-572'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-573'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' id='type-id-574'/>
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-575'/>
    <reference-type-def kind='lvalue' type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-577'/>
    <qualified-type-def type-id='type-id-577' const='yes' id='type-id-578'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-579'/>
    <reference-type-def kind='lvalue' type-id='type-id-579' size-in-bits='64' id='type-id-580'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-581'/>
    <qualified-type-def type-id='type-id-582' const='yes' id='type-id-583'/>
    <reference-type-def kind='lvalue' type-id='type-id-583' size-in-bits='64' id='type-id-584'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-585'/>
    <reference-type-def kind='lvalue' type-id='type-id-585' size-in-bits='64' id='type-id-586'/>
    <pointer-type-def type-id='type-id-585' size-in-bits='64' id='type-id-587'/>
    <qualified-type-def type-id='type-id-587' const='yes' id='type-id-588'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-589'/>
    <reference-type-def kind='lvalue' type-id='type-id-589' size-in-bits='64' id='type-id-590'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-591'/>
    <qualified-type-def type-id='type-id-591' const='yes' id='type-id-592'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-593'/>
    <pointer-type-def type-id='type-id-593' size-in-bits='64' id='type-id-185'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-594'/>
    <reference-type-def kind='lvalue' type-id='type-id-594' size-in-bits='64' id='type-id-595'/>
    <reference-type-def kind='rvalue' type-id='type-id-594' size-in-bits='64' id='type-id-596'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-597'/>
    <reference-type-def kind='lvalue' type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-599' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-83'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-601'/>
    <reference-type-def kind='lvalue' type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-604'/>
    <reference-type-def kind='lvalue' type-id='type-id-604' size-in-bits='64' id='type-id-605'/>
    <reference-type-def kind='rvalue' type-id='type-id-604' size-in-bits='64' id='type-id-606'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-607'/>
    <reference-type-def kind='lvalue' type-id='type-id-607' size-in-bits='64' id='type-id-608'/>
    <reference-type-def kind='rvalue' type-id='type-id-607' size-in-bits='64' id='type-id-609'/>
    <qualified-type-def type-id='type-id-176' const='yes' id='type-id-610'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-612' size-in-bits='64' id='type-id-613'/>
    <reference-type-def kind='rvalue' type-id='type-id-612' size-in-bits='64' id='type-id-614'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-615'/>
    <reference-type-def kind='lvalue' type-id='type-id-615' size-in-bits='64' id='type-id-616'/>
    <reference-type-def kind='rvalue' type-id='type-id-615' size-in-bits='64' id='type-id-617'/>
    <qualified-type-def type-id='type-id-204' const='yes' id='type-id-618'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-620'/>
    <reference-type-def kind='lvalue' type-id='type-id-620' size-in-bits='64' id='type-id-621'/>
    <reference-type-def kind='rvalue' type-id='type-id-620' size-in-bits='64' id='type-id-622'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-623'/>
    <reference-type-def kind='lvalue' type-id='type-id-623' size-in-bits='64' id='type-id-624'/>
    <reference-type-def kind='rvalue' type-id='type-id-623' size-in-bits='64' id='type-id-625'/>
    <qualified-type-def type-id='type-id-626' const='yes' id='type-id-627'/>
    <reference-type-def kind='lvalue' type-id='type-id-627' size-in-bits='64' id='type-id-628'/>
    <qualified-type-def type-id='type-id-629' const='yes' id='type-id-630'/>
    <reference-type-def kind='lvalue' type-id='type-id-630' size-in-bits='64' id='type-id-631'/>
    <qualified-type-def type-id='type-id-632' const='yes' id='type-id-633'/>
    <reference-type-def kind='lvalue' type-id='type-id-633' size-in-bits='64' id='type-id-634'/>
    <qualified-type-def type-id='type-id-635' const='yes' id='type-id-636'/>
    <reference-type-def kind='lvalue' type-id='type-id-636' size-in-bits='64' id='type-id-637'/>
    <qualified-type-def type-id='type-id-638' const='yes' id='type-id-639'/>
    <reference-type-def kind='lvalue' type-id='type-id-639' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-641' const='yes' id='type-id-642'/>
    <reference-type-def kind='lvalue' type-id='type-id-642' size-in-bits='64' id='type-id-643'/>
    <qualified-type-def type-id='type-id-644' const='yes' id='type-id-645'/>
    <reference-type-def kind='lvalue' type-id='type-id-645' size-in-bits='64' id='type-id-646'/>
    <qualified-type-def type-id='type-id-647' const='yes' id='type-id-648'/>
    <reference-type-def kind='lvalue' type-id='type-id-648' size-in-bits='64' id='type-id-649'/>
    <qualified-type-def type-id='type-id-650' const='yes' id='type-id-651'/>
    <pointer-type-def type-id='type-id-651' size-in-bits='64' id='type-id-652'/>
    <qualified-type-def type-id='type-id-652' const='yes' id='type-id-653'/>
    <qualified-type-def type-id='type-id-654' const='yes' id='type-id-655'/>
    <reference-type-def kind='lvalue' type-id='type-id-655' size-in-bits='64' id='type-id-656'/>
    <pointer-type-def type-id='type-id-655' size-in-bits='64' id='type-id-657'/>
    <qualified-type-def type-id='type-id-658' const='yes' id='type-id-659'/>
    <pointer-type-def type-id='type-id-659' size-in-bits='64' id='type-id-660'/>
    <qualified-type-def type-id='type-id-660' const='yes' id='type-id-661'/>
    <qualified-type-def type-id='type-id-662' const='yes' id='type-id-663'/>
    <reference-type-def kind='lvalue' type-id='type-id-663' size-in-bits='64' id='type-id-664'/>
    <qualified-type-def type-id='type-id-665' const='yes' id='type-id-666'/>
    <reference-type-def kind='lvalue' type-id='type-id-666' size-in-bits='64' id='type-id-667'/>
    <qualified-type-def type-id='type-id-668' const='yes' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-669' size-in-bits='64' id='type-id-670'/>
    <qualified-type-def type-id='type-id-671' const='yes' id='type-id-672'/>
    <reference-type-def kind='lvalue' type-id='type-id-672' size-in-bits='64' id='type-id-673'/>
    <pointer-type-def type-id='type-id-672' size-in-bits='64' id='type-id-674'/>
    <qualified-type-def type-id='type-id-674' const='yes' id='type-id-675'/>
    <qualified-type-def type-id='type-id-676' const='yes' id='type-id-677'/>
    <reference-type-def kind='lvalue' type-id='type-id-677' size-in-bits='64' id='type-id-678'/>
    <qualified-type-def type-id='type-id-679' const='yes' id='type-id-680'/>
    <qualified-type-def type-id='type-id-681' const='yes' id='type-id-682'/>
    <pointer-type-def type-id='type-id-682' size-in-bits='64' id='type-id-683'/>
    <qualified-type-def type-id='type-id-683' const='yes' id='type-id-684'/>
    <qualified-type-def type-id='type-id-685' const='yes' id='type-id-686'/>
    <reference-type-def kind='lvalue' type-id='type-id-686' size-in-bits='64' id='type-id-687'/>
    <qualified-type-def type-id='type-id-688' const='yes' id='type-id-689'/>
    <reference-type-def kind='lvalue' type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <qualified-type-def type-id='type-id-691' const='yes' id='type-id-692'/>
    <reference-type-def kind='lvalue' type-id='type-id-692' size-in-bits='64' id='type-id-693'/>
    <qualified-type-def type-id='type-id-694' const='yes' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' id='type-id-696'/>
    <qualified-type-def type-id='type-id-697' const='yes' id='type-id-698'/>
    <reference-type-def kind='lvalue' type-id='type-id-698' size-in-bits='64' id='type-id-699'/>
    <qualified-type-def type-id='type-id-700' const='yes' id='type-id-701'/>
    <reference-type-def kind='lvalue' type-id='type-id-701' size-in-bits='64' id='type-id-702'/>
    <qualified-type-def type-id='type-id-703' const='yes' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
    <qualified-type-def type-id='type-id-706' const='yes' id='type-id-707'/>
    <reference-type-def kind='lvalue' type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
    <qualified-type-def type-id='type-id-709' const='yes' id='type-id-710'/>
    <reference-type-def kind='lvalue' type-id='type-id-710' size-in-bits='64' id='type-id-711'/>
    <qualified-type-def type-id='type-id-712' const='yes' id='type-id-713'/>
    <reference-type-def kind='lvalue' type-id='type-id-713' size-in-bits='64' id='type-id-714'/>
    <qualified-type-def type-id='type-id-715' const='yes' id='type-id-716'/>
    <reference-type-def kind='lvalue' type-id='type-id-716' size-in-bits='64' id='type-id-717'/>
    <qualified-type-def type-id='type-id-718' const='yes' id='type-id-719'/>
    <reference-type-def kind='lvalue' type-id='type-id-719' size-in-bits='64' id='type-id-720'/>
    <qualified-type-def type-id='type-id-721' const='yes' id='type-id-722'/>
    <reference-type-def kind='lvalue' type-id='type-id-722' size-in-bits='64' id='type-id-723'/>
    <qualified-type-def type-id='type-id-724' const='yes' id='type-id-725'/>
    <reference-type-def kind='lvalue' type-id='type-id-725' size-in-bits='64' id='type-id-726'/>
    <qualified-type-def type-id='type-id-727' const='yes' id='type-id-728'/>
    <reference-type-def kind='lvalue' type-id='type-id-728' size-in-bits='64' id='type-id-729'/>
    <qualified-type-def type-id='type-id-730' const='yes' id='type-id-731'/>
    <reference-type-def kind='lvalue' type-id='type-id-731' size-in-bits='64' id='type-id-732'/>
    <qualified-type-def type-id='type-id-733' const='yes' id='type-id-734'/>
    <reference-type-def kind='lvalue' type-id='type-id-734' size-in-bits='64' id='type-id-735'/>
    <qualified-type-def type-id='type-id-736' const='yes' id='type-id-737'/>
    <reference-type-def kind='lvalue' type-id='type-id-737' size-in-bits='64' id='type-id-738'/>
    <qualified-type-def type-id='type-id-739' const='yes' id='type-id-740'/>
    <reference-type-def kind='lvalue' type-id='type-id-740' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-742' const='yes' id='type-id-743'/>
    <reference-type-def kind='lvalue' type-id='type-id-743' size-in-bits='64' id='type-id-744'/>
    <qualified-type-def type-id='type-id-745' const='yes' id='type-id-746'/>
    <reference-type-def kind='lvalue' type-id='type-id-746' size-in-bits='64' id='type-id-747'/>
    <qualified-type-def type-id='type-id-748' const='yes' id='type-id-749'/>
    <reference-type-def kind='lvalue' type-id='type-id-749' size-in-bits='64' id='type-id-750'/>
    <qualified-type-def type-id='type-id-751' const='yes' id='type-id-752'/>
    <reference-type-def kind='lvalue' type-id='type-id-752' size-in-bits='64' id='type-id-753'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <reference-type-def kind='lvalue' type-id='type-id-755' size-in-bits='64' id='type-id-756'/>
    <qualified-type-def type-id='type-id-757' const='yes' id='type-id-758'/>
    <pointer-type-def type-id='type-id-758' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-759' const='yes' id='type-id-760'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-761'/>
    <pointer-type-def type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-762' const='yes' id='type-id-763'/>
    <qualified-type-def type-id='type-id-764' const='yes' id='type-id-765'/>
    <reference-type-def kind='lvalue' type-id='type-id-765' size-in-bits='64' id='type-id-766'/>
    <qualified-type-def type-id='type-id-767' const='yes' id='type-id-768'/>
    <pointer-type-def type-id='type-id-768' size-in-bits='64' id='type-id-769'/>
    <qualified-type-def type-id='type-id-769' const='yes' id='type-id-770'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-771'/>
    <pointer-type-def type-id='type-id-771' size-in-bits='64' id='type-id-772'/>
    <qualified-type-def type-id='type-id-772' const='yes' id='type-id-773'/>
    <qualified-type-def type-id='type-id-774' const='yes' id='type-id-775'/>
    <reference-type-def kind='lvalue' type-id='type-id-775' size-in-bits='64' id='type-id-776'/>
    <qualified-type-def type-id='type-id-777' const='yes' id='type-id-778'/>
    <pointer-type-def type-id='type-id-778' size-in-bits='64' id='type-id-779'/>
    <qualified-type-def type-id='type-id-779' const='yes' id='type-id-780'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-781'/>
    <pointer-type-def type-id='type-id-781' size-in-bits='64' id='type-id-782'/>
    <qualified-type-def type-id='type-id-782' const='yes' id='type-id-783'/>
    <qualified-type-def type-id='type-id-784' const='yes' id='type-id-785'/>
    <reference-type-def kind='lvalue' type-id='type-id-785' size-in-bits='64' id='type-id-786'/>
    <qualified-type-def type-id='type-id-787' const='yes' id='type-id-788'/>
    <pointer-type-def type-id='type-id-788' size-in-bits='64' id='type-id-789'/>
    <qualified-type-def type-id='type-id-789' const='yes' id='type-id-790'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-791'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <qualified-type-def type-id='type-id-792' const='yes' id='type-id-793'/>
    <qualified-type-def type-id='type-id-794' const='yes' id='type-id-795'/>
    <reference-type-def kind='lvalue' type-id='type-id-795' size-in-bits='64' id='type-id-796'/>
    <qualified-type-def type-id='type-id-797' const='yes' id='type-id-798'/>
    <pointer-type-def type-id='type-id-798' size-in-bits='64' id='type-id-799'/>
    <qualified-type-def type-id='type-id-799' const='yes' id='type-id-800'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-801'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-802'/>
    <qualified-type-def type-id='type-id-802' const='yes' id='type-id-803'/>
    <qualified-type-def type-id='type-id-804' const='yes' id='type-id-805'/>
    <reference-type-def kind='lvalue' type-id='type-id-805' size-in-bits='64' id='type-id-806'/>
    <qualified-type-def type-id='type-id-807' const='yes' id='type-id-808'/>
    <pointer-type-def type-id='type-id-808' size-in-bits='64' id='type-id-809'/>
    <qualified-type-def type-id='type-id-809' const='yes' id='type-id-810'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-811'/>
    <pointer-type-def type-id='type-id-811' size-in-bits='64' id='type-id-812'/>
    <qualified-type-def type-id='type-id-812' const='yes' id='type-id-813'/>
    <qualified-type-def type-id='type-id-814' const='yes' id='type-id-815'/>
    <reference-type-def kind='lvalue' type-id='type-id-815' size-in-bits='64' id='type-id-816'/>
    <qualified-type-def type-id='type-id-817' const='yes' id='type-id-818'/>
    <pointer-type-def type-id='type-id-818' size-in-bits='64' id='type-id-819'/>
    <qualified-type-def type-id='type-id-820' const='yes' id='type-id-821'/>
    <pointer-type-def type-id='type-id-821' size-in-bits='64' id='type-id-822'/>
    <qualified-type-def type-id='type-id-823' const='yes' id='type-id-824'/>
    <pointer-type-def type-id='type-id-824' size-in-bits='64' id='type-id-825'/>
    <qualified-type-def type-id='type-id-826' const='yes' id='type-id-827'/>
    <pointer-type-def type-id='type-id-827' size-in-bits='64' id='type-id-828'/>
    <qualified-type-def type-id='type-id-829' const='yes' id='type-id-830'/>
    <pointer-type-def type-id='type-id-830' size-in-bits='64' id='type-id-831'/>
    <qualified-type-def type-id='type-id-832' const='yes' id='type-id-833'/>
    <pointer-type-def type-id='type-id-833' size-in-bits='64' id='type-id-834'/>
    <qualified-type-def type-id='type-id-835' const='yes' id='type-id-836'/>
    <pointer-type-def type-id='type-id-836' size-in-bits='64' id='type-id-837'/>
    <qualified-type-def type-id='type-id-838' const='yes' id='type-id-839'/>
    <pointer-type-def type-id='type-id-839' size-in-bits='64' id='type-id-840'/>
    <qualified-type-def type-id='type-id-840' const='yes' id='type-id-841'/>
    <qualified-type-def type-id='type-id-842' const='yes' id='type-id-843'/>
    <pointer-type-def type-id='type-id-843' size-in-bits='64' id='type-id-844'/>
    <qualified-type-def type-id='type-id-845' const='yes' id='type-id-846'/>
    <pointer-type-def type-id='type-id-846' size-in-bits='64' id='type-id-847'/>
    <qualified-type-def type-id='type-id-847' const='yes' id='type-id-848'/>
    <qualified-type-def type-id='type-id-849' const='yes' id='type-id-850'/>
    <pointer-type-def type-id='type-id-850' size-in-bits='64' id='type-id-851'/>
    <qualified-type-def type-id='type-id-852' const='yes' id='type-id-853'/>
    <pointer-type-def type-id='type-id-853' size-in-bits='64' id='type-id-854'/>
    <qualified-type-def type-id='type-id-855' const='yes' id='type-id-856'/>
    <pointer-type-def type-id='type-id-856' size-in-bits='64' id='type-id-857'/>
    <qualified-type-def type-id='type-id-858' const='yes' id='type-id-859'/>
    <pointer-type-def type-id='type-id-859' size-in-bits='64' id='type-id-860'/>
    <qualified-type-def type-id='type-id-861' const='yes' id='type-id-862'/>
    <pointer-type-def type-id='type-id-862' size-in-bits='64' id='type-id-863'/>
    <qualified-type-def type-id='type-id-863' const='yes' id='type-id-864'/>
    <qualified-type-def type-id='type-id-865' const='yes' id='type-id-866'/>
    <pointer-type-def type-id='type-id-866' size-in-bits='64' id='type-id-867'/>
    <qualified-type-def type-id='type-id-867' const='yes' id='type-id-868'/>
    <qualified-type-def type-id='type-id-869' const='yes' id='type-id-870'/>
    <pointer-type-def type-id='type-id-870' size-in-bits='64' id='type-id-871'/>
    <qualified-type-def type-id='type-id-871' const='yes' id='type-id-872'/>
    <qualified-type-def type-id='type-id-873' const='yes' id='type-id-874'/>
    <pointer-type-def type-id='type-id-874' size-in-bits='64' id='type-id-875'/>
    <qualified-type-def type-id='type-id-875' const='yes' id='type-id-876'/>
    <qualified-type-def type-id='type-id-877' const='yes' id='type-id-878'/>
    <pointer-type-def type-id='type-id-878' size-in-bits='64' id='type-id-879'/>
    <qualified-type-def type-id='type-id-879' const='yes' id='type-id-880'/>
    <qualified-type-def type-id='type-id-881' const='yes' id='type-id-882'/>
    <pointer-type-def type-id='type-id-882' size-in-bits='64' id='type-id-883'/>
    <qualified-type-def type-id='type-id-883' const='yes' id='type-id-884'/>
    <qualified-type-def type-id='type-id-885' const='yes' id='type-id-886'/>
    <pointer-type-def type-id='type-id-886' size-in-bits='64' id='type-id-887'/>
    <qualified-type-def type-id='type-id-887' const='yes' id='type-id-888'/>
    <qualified-type-def type-id='type-id-889' const='yes' id='type-id-890'/>
    <pointer-type-def type-id='type-id-890' size-in-bits='64' id='type-id-891'/>
    <qualified-type-def type-id='type-id-891' const='yes' id='type-id-892'/>
    <qualified-type-def type-id='type-id-893' const='yes' id='type-id-894'/>
    <pointer-type-def type-id='type-id-894' size-in-bits='64' id='type-id-895'/>
    <qualified-type-def type-id='type-id-895' const='yes' id='type-id-896'/>
    <qualified-type-def type-id='type-id-897' const='yes' id='type-id-898'/>
    <pointer-type-def type-id='type-id-898' size-in-bits='64' id='type-id-899'/>
    <qualified-type-def type-id='type-id-899' const='yes' id='type-id-900'/>
    <qualified-type-def type-id='type-id-901' const='yes' id='type-id-902'/>
    <pointer-type-def type-id='type-id-902' size-in-bits='64' id='type-id-903'/>
    <qualified-type-def type-id='type-id-903' const='yes' id='type-id-904'/>
    <qualified-type-def type-id='type-id-905' const='yes' id='type-id-906'/>
    <pointer-type-def type-id='type-id-906' size-in-bits='64' id='type-id-907'/>
    <qualified-type-def type-id='type-id-907' const='yes' id='type-id-908'/>
    <qualified-type-def type-id='type-id-909' const='yes' id='type-id-910'/>
    <reference-type-def kind='lvalue' type-id='type-id-910' size-in-bits='64' id='type-id-911'/>
    <qualified-type-def type-id='type-id-912' const='yes' id='type-id-913'/>
    <reference-type-def kind='lvalue' type-id='type-id-913' size-in-bits='64' id='type-id-914'/>
    <qualified-type-def type-id='type-id-915' const='yes' id='type-id-916'/>
    <reference-type-def kind='lvalue' type-id='type-id-916' size-in-bits='64' id='type-id-917'/>
    <qualified-type-def type-id='type-id-918' const='yes' id='type-id-919'/>
    <reference-type-def kind='lvalue' type-id='type-id-919' size-in-bits='64' id='type-id-920'/>
    <qualified-type-def type-id='type-id-921' const='yes' id='type-id-922'/>
    <reference-type-def kind='lvalue' type-id='type-id-922' size-in-bits='64' id='type-id-923'/>
    <qualified-type-def type-id='type-id-924' const='yes' id='type-id-925'/>
    <reference-type-def kind='lvalue' type-id='type-id-925' size-in-bits='64' id='type-id-926'/>
    <qualified-type-def type-id='type-id-927' const='yes' id='type-id-928'/>
    <reference-type-def kind='lvalue' type-id='type-id-928' size-in-bits='64' id='type-id-929'/>
    <qualified-type-def type-id='type-id-930' const='yes' id='type-id-931'/>
    <reference-type-def kind='lvalue' type-id='type-id-931' size-in-bits='64' id='type-id-932'/>
    <qualified-type-def type-id='type-id-933' const='yes' id='type-id-934'/>
    <reference-type-def kind='lvalue' type-id='type-id-934' size-in-bits='64' id='type-id-935'/>
    <qualified-type-def type-id='type-id-936' const='yes' id='type-id-937'/>
    <reference-type-def kind='lvalue' type-id='type-id-937' size-in-bits='64' id='type-id-938'/>
    <qualified-type-def type-id='type-id-939' const='yes' id='type-id-940'/>
    <reference-type-def kind='lvalue' type-id='type-id-940' size-in-bits='64' id='type-id-941'/>
    <qualified-type-def type-id='type-id-942' const='yes' id='type-id-943'/>
    <reference-type-def kind='lvalue' type-id='type-id-943' size-in-bits='64' id='type-id-944'/>
    <qualified-type-def type-id='type-id-945' const='yes' id='type-id-946'/>
    <reference-type-def kind='lvalue' type-id='type-id-946' size-in-bits='64' id='type-id-947'/>
    <qualified-type-def type-id='type-id-948' const='yes' id='type-id-949'/>
    <reference-type-def kind='lvalue' type-id='type-id-949' size-in-bits='64' id='type-id-950'/>
    <qualified-type-def type-id='type-id-951' const='yes' id='type-id-952'/>
    <reference-type-def kind='lvalue' type-id='type-id-952' size-in-bits='64' id='type-id-953'/>
    <qualified-type-def type-id='type-id-954' const='yes' id='type-id-955'/>
    <reference-type-def kind='lvalue' type-id='type-id-955' size-in-bits='64' id='type-id-956'/>
    <qualified-type-def type-id='type-id-957' const='yes' id='type-id-958'/>
    <reference-type-def kind='lvalue' type-id='type-id-958' size-in-bits='64' id='type-id-959'/>
    <qualified-type-def type-id='type-id-960' const='yes' id='type-id-961'/>
    <reference-type-def kind='lvalue' type-id='type-id-961' size-in-bits='64' id='type-id-962'/>
    <qualified-type-def type-id='type-id-963' const='yes' id='type-id-964'/>
    <reference-type-def kind='lvalue' type-id='type-id-964' size-in-bits='64' id='type-id-965'/>
    <qualified-type-def type-id='type-id-966' const='yes' id='type-id-967'/>
    <reference-type-def kind='lvalue' type-id='type-id-967' size-in-bits='64' id='type-id-968'/>
    <qualified-type-def type-id='type-id-969' const='yes' id='type-id-970'/>
    <reference-type-def kind='lvalue' type-id='type-id-970' size-in-bits='64' id='type-id-971'/>
    <qualified-type-def type-id='type-id-972' const='yes' id='type-id-973'/>
    <pointer-type-def type-id='type-id-973' size-in-bits='64' id='type-id-974'/>
    <qualified-type-def type-id='type-id-974' const='yes' id='type-id-975'/>
    <qualified-type-def type-id='type-id-976' const='yes' id='type-id-977'/>
    <pointer-type-def type-id='type-id-977' size-in-bits='64' id='type-id-978'/>
    <qualified-type-def type-id='type-id-978' const='yes' id='type-id-979'/>
    <qualified-type-def type-id='type-id-980' const='yes' id='type-id-981'/>
    <pointer-type-def type-id='type-id-981' size-in-bits='64' id='type-id-982'/>
    <qualified-type-def type-id='type-id-983' const='yes' id='type-id-984'/>
    <pointer-type-def type-id='type-id-984' size-in-bits='64' id='type-id-985'/>
    <qualified-type-def type-id='type-id-986' const='yes' id='type-id-987'/>
    <pointer-type-def type-id='type-id-987' size-in-bits='64' id='type-id-988'/>
    <qualified-type-def type-id='type-id-988' const='yes' id='type-id-989'/>
    <qualified-type-def type-id='type-id-990' const='yes' id='type-id-991'/>
    <pointer-type-def type-id='type-id-991' size-in-bits='64' id='type-id-992'/>
    <qualified-type-def type-id='type-id-992' const='yes' id='type-id-993'/>
    <qualified-type-def type-id='type-id-994' const='yes' id='type-id-995'/>
    <pointer-type-def type-id='type-id-995' size-in-bits='64' id='type-id-996'/>
    <qualified-type-def type-id='type-id-996' const='yes' id='type-id-997'/>
    <qualified-type-def type-id='type-id-998' const='yes' id='type-id-999'/>
    <qualified-type-def type-id='type-id-1000' const='yes' id='type-id-1001'/>
    <qualified-type-def type-id='type-id-1002' const='yes' id='type-id-1003'/>
    <qualified-type-def type-id='type-id-1004' const='yes' id='type-id-1005'/>
    <qualified-type-def type-id='type-id-1006' const='yes' id='type-id-1007'/>
    <qualified-type-def type-id='type-id-1008' const='yes' id='type-id-1009'/>
    <qualified-type-def type-id='type-id-1010' const='yes' id='type-id-1011'/>
    <reference-type-def kind='lvalue' type-id='type-id-1011' size-in-bits='64' id='type-id-1012'/>
    <pointer-type-def type-id='type-id-1011' size-in-bits='64' id='type-id-1013'/>
    <qualified-type-def type-id='type-id-1014' const='yes' id='type-id-1015'/>
    <reference-type-def kind='lvalue' type-id='type-id-1015' size-in-bits='64' id='type-id-1016'/>
    <qualified-type-def type-id='type-id-1017' const='yes' id='type-id-1018'/>
    <reference-type-def kind='lvalue' type-id='type-id-1018' size-in-bits='64' id='type-id-1019'/>
    <qualified-type-def type-id='type-id-1020' const='yes' id='type-id-1021'/>
    <reference-type-def kind='lvalue' type-id='type-id-1021' size-in-bits='64' id='type-id-1022'/>
    <qualified-type-def type-id='type-id-1023' const='yes' id='type-id-1024'/>
    <reference-type-def kind='lvalue' type-id='type-id-1024' size-in-bits='64' id='type-id-1025'/>
    <qualified-type-def type-id='type-id-1026' const='yes' id='type-id-1027'/>
    <pointer-type-def type-id='type-id-1027' size-in-bits='64' id='type-id-1028'/>
    <qualified-type-def type-id='type-id-1029' const='yes' id='type-id-1030'/>
    <pointer-type-def type-id='type-id-1030' size-in-bits='64' id='type-id-1031'/>
    <qualified-type-def type-id='type-id-1032' const='yes' id='type-id-1033'/>
    <pointer-type-def type-id='type-id-1033' size-in-bits='64' id='type-id-1034'/>
    <qualified-type-def type-id='type-id-1035' const='yes' id='type-id-1036'/>
    <reference-type-def kind='lvalue' type-id='type-id-1036' size-in-bits='64' id='type-id-1037'/>
    <reference-type-def kind='rvalue' type-id='type-id-1036' size-in-bits='64' id='type-id-1038'/>
    <pointer-type-def type-id='type-id-1036' size-in-bits='64' id='type-id-1039'/>
    <qualified-type-def type-id='type-id-1039' const='yes' id='type-id-1040'/>
    <qualified-type-def type-id='type-id-1041' const='yes' id='type-id-1042'/>
    <reference-type-def kind='lvalue' type-id='type-id-1042' size-in-bits='64' id='type-id-1043'/>
    <pointer-type-def type-id='type-id-1042' size-in-bits='64' id='type-id-1044'/>
    <qualified-type-def type-id='type-id-1045' const='yes' id='type-id-1046'/>
    <reference-type-def kind='lvalue' type-id='type-id-1046' size-in-bits='64' id='type-id-1047'/>
    <pointer-type-def type-id='type-id-1046' size-in-bits='64' id='type-id-1048'/>
    <qualified-type-def type-id='type-id-1049' const='yes' id='type-id-1050'/>
    <reference-type-def kind='lvalue' type-id='type-id-1050' size-in-bits='64' id='type-id-1051'/>
    <qualified-type-def type-id='type-id-1052' const='yes' id='type-id-1053'/>
    <pointer-type-def type-id='type-id-1053' size-in-bits='64' id='type-id-1054'/>
    <qualified-type-def type-id='type-id-1055' const='yes' id='type-id-1056'/>
    <pointer-type-def type-id='type-id-1056' size-in-bits='64' id='type-id-1057'/>
    <qualified-type-def type-id='type-id-1058' const='yes' id='type-id-1059'/>
    <pointer-type-def type-id='type-id-1059' size-in-bits='64' id='type-id-1060'/>
    <qualified-type-def type-id='type-id-1060' const='yes' id='type-id-1061'/>
    <qualified-type-def type-id='type-id-1062' const='yes' id='type-id-1063'/>
    <pointer-type-def type-id='type-id-1063' size-in-bits='64' id='type-id-1064'/>
    <qualified-type-def type-id='type-id-1065' const='yes' id='type-id-1066'/>
    <pointer-type-def type-id='type-id-1066' size-in-bits='64' id='type-id-1067'/>
    <qualified-type-def type-id='type-id-1068' const='yes' id='type-id-1069'/>
    <pointer-type-def type-id='type-id-1069' size-in-bits='64' id='type-id-1070'/>
    <qualified-type-def type-id='type-id-1071' const='yes' id='type-id-1072'/>
    <pointer-type-def type-id='type-id-1072' size-in-bits='64' id='type-id-1073'/>
    <qualified-type-def type-id='type-id-1074' const='yes' id='type-id-1075'/>
    <pointer-type-def type-id='type-id-1075' size-in-bits='64' id='type-id-1076'/>
    <qualified-type-def type-id='type-id-1077' const='yes' id='type-id-1078'/>
    <pointer-type-def type-id='type-id-1078' size-in-bits='64' id='type-id-1079'/>
    <qualified-type-def type-id='type-id-1080' const='yes' id='type-id-1081'/>
    <pointer-type-def type-id='type-id-1081' size-in-bits='64' id='type-id-1082'/>
    <qualified-type-def type-id='type-id-1082' const='yes' id='type-id-1083'/>
    <qualified-type-def type-id='type-id-1084' const='yes' id='type-id-1085'/>
    <pointer-type-def type-id='type-id-1085' size-in-bits='64' id='type-id-1086'/>
    <qualified-type-def type-id='type-id-1086' const='yes' id='type-id-1087'/>
    <qualified-type-def type-id='type-id-1088' const='yes' id='type-id-1089'/>
    <qualified-type-def type-id='type-id-1090' const='yes' id='type-id-1091'/>
    <reference-type-def kind='lvalue' type-id='type-id-1091' size-in-bits='64' id='type-id-1092'/>
    <pointer-type-def type-id='type-id-1091' size-in-bits='64' id='type-id-1093'/>
    <qualified-type-def type-id='type-id-1093' const='yes' id='type-id-1094'/>
    <qualified-type-def type-id='type-id-1095' const='yes' id='type-id-1096'/>
    <reference-type-def kind='lvalue' type-id='type-id-1096' size-in-bits='64' id='type-id-1097'/>
    <pointer-type-def type-id='type-id-1096' size-in-bits='64' id='type-id-1098'/>
    <qualified-type-def type-id='type-id-1098' const='yes' id='type-id-1099'/>
    <qualified-type-def type-id='type-id-1100' const='yes' id='type-id-1101'/>
    <pointer-type-def type-id='type-id-1101' size-in-bits='64' id='type-id-1102'/>
    <qualified-type-def type-id='type-id-1103' const='yes' id='type-id-1104'/>
    <reference-type-def kind='lvalue' type-id='type-id-1104' size-in-bits='64' id='type-id-1105'/>
    <pointer-type-def type-id='type-id-1104' size-in-bits='64' id='type-id-1106'/>
    <qualified-type-def type-id='type-id-1106' const='yes' id='type-id-1107'/>
    <qualified-type-def type-id='type-id-1108' const='yes' id='type-id-1109'/>
    <reference-type-def kind='lvalue' type-id='type-id-1109' size-in-bits='64' id='type-id-1110'/>
    <pointer-type-def type-id='type-id-1109' size-in-bits='64' id='type-id-1111'/>
    <qualified-type-def type-id='type-id-1111' const='yes' id='type-id-1112'/>
    <qualified-type-def type-id='type-id-1113' const='yes' id='type-id-1114'/>
    <reference-type-def kind='lvalue' type-id='type-id-1114' size-in-bits='64' id='type-id-1115'/>
    <pointer-type-def type-id='type-id-1114' size-in-bits='64' id='type-id-1116'/>
    <qualified-type-def type-id='type-id-1116' const='yes' id='type-id-1117'/>
    <qualified-type-def type-id='type-id-1118' const='yes' id='type-id-1119'/>
    <reference-type-def kind='lvalue' type-id='type-id-1119' size-in-bits='64' id='type-id-1120'/>
    <pointer-type-def type-id='type-id-1119' size-in-bits='64' id='type-id-1121'/>
    <qualified-type-def type-id='type-id-1122' const='yes' id='type-id-1123'/>
    <reference-type-def kind='lvalue' type-id='type-id-1123' size-in-bits='64' id='type-id-1124'/>
    <pointer-type-def type-id='type-id-1123' size-in-bits='64' id='type-id-1125'/>
    <qualified-type-def type-id='type-id-1126' const='yes' id='type-id-1127'/>
    <reference-type-def kind='lvalue' type-id='type-id-1127' size-in-bits='64' id='type-id-1128'/>
    <pointer-type-def type-id='type-id-1127' size-in-bits='64' id='type-id-1129'/>
    <qualified-type-def type-id='type-id-1129' const='yes' id='type-id-1130'/>
    <qualified-type-def type-id='type-id-1131' const='yes' id='type-id-1132'/>
    <reference-type-def kind='lvalue' type-id='type-id-1132' size-in-bits='64' id='type-id-1133'/>
    <pointer-type-def type-id='type-id-1132' size-in-bits='64' id='type-id-1134'/>
    <qualified-type-def type-id='type-id-1134' const='yes' id='type-id-1135'/>
    <qualified-type-def type-id='type-id-1136' const='yes' id='type-id-1137'/>
    <reference-type-def kind='lvalue' type-id='type-id-1137' size-in-bits='64' id='type-id-1138'/>
    <pointer-type-def type-id='type-id-1137' size-in-bits='64' id='type-id-1139'/>
    <qualified-type-def type-id='type-id-1139' const='yes' id='type-id-1140'/>
    <qualified-type-def type-id='type-id-1141' const='yes' id='type-id-1142'/>
    <reference-type-def kind='lvalue' type-id='type-id-1142' size-in-bits='64' id='type-id-1143'/>
    <qualified-type-def type-id='type-id-1144' const='yes' id='type-id-1145'/>
    <reference-type-def kind='lvalue' type-id='type-id-1145' size-in-bits='64' id='type-id-1146'/>
    <qualified-type-def type-id='type-id-1147' const='yes' id='type-id-1148'/>
    <qualified-type-def type-id='type-id-1149' const='yes' id='type-id-1150'/>
    <reference-type-def kind='lvalue' type-id='type-id-1150' size-in-bits='64' id='type-id-1151'/>
    <qualified-type-def type-id='type-id-212' const='yes' id='type-id-1152'/>
    <pointer-type-def type-id='type-id-1152' size-in-bits='64' id='type-id-1153'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-1154'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-1155'/>
    <pointer-type-def type-id='type-id-1155' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-1156'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-1157'/>
    <reference-type-def kind='lvalue' type-id='type-id-1157' size-in-bits='64' id='type-id-1158'/>
    <reference-type-def kind='rvalue' type-id='type-id-1157' size-in-bits='64' id='type-id-1159'/>
    <pointer-type-def type-id='type-id-1157' size-in-bits='64' id='type-id-1160'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-1161'/>
    <reference-type-def kind='lvalue' type-id='type-id-1161' size-in-bits='64' id='type-id-1162'/>
    <reference-type-def kind='rvalue' type-id='type-id-1161' size-in-bits='64' id='type-id-1163'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-1164'/>
    <reference-type-def kind='lvalue' type-id='type-id-1164' size-in-bits='64' id='type-id-1165'/>
    <reference-type-def kind='rvalue' type-id='type-id-1164' size-in-bits='64' id='type-id-1166'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-1167'/>
    <reference-type-def kind='lvalue' type-id='type-id-1167' size-in-bits='64' id='type-id-1168'/>
    <reference-type-def kind='rvalue' type-id='type-id-1167' size-in-bits='64' id='type-id-1169'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-1170'/>
    <pointer-type-def type-id='type-id-1170' size-in-bits='64' id='type-id-1171'/>
    <pointer-type-def type-id='type-id-1171' size-in-bits='64' id='type-id-1172'/>
    <reference-type-def kind='lvalue' type-id='type-id-19' size-in-bits='64' id='type-id-1173'/>
    <reference-type-def kind='rvalue' type-id='type-id-19' size-in-bits='64' id='type-id-1174'/>
    <pointer-type-def type-id='type-id-1175' size-in-bits='64' id='type-id-1176'/>
    <qualified-type-def type-id='type-id-1176' const='yes' id='type-id-1177'/>
    <reference-type-def kind='lvalue' type-id='type-id-1177' size-in-bits='64' id='type-id-1178'/>
    <reference-type-def kind='lvalue' type-id='type-id-20' size-in-bits='64' id='type-id-1179'/>
    <reference-type-def kind='rvalue' type-id='type-id-20' size-in-bits='64' id='type-id-1180'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-1181'/>
    <pointer-type-def type-id='type-id-1182' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-1183' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-1184' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-1185' size-in-bits='64' id='type-id-183'/>
    <reference-type-def kind='lvalue' type-id='type-id-21' size-in-bits='64' id='type-id-1186'/>
    <reference-type-def kind='rvalue' type-id='type-id-21' size-in-bits='64' id='type-id-1187'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-1188'/>
    <reference-type-def kind='lvalue' type-id='type-id-23' size-in-bits='64' id='type-id-1189'/>
    <reference-type-def kind='rvalue' type-id='type-id-23' size-in-bits='64' id='type-id-1190'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-1191'/>
    <reference-type-def kind='lvalue' type-id='type-id-26' size-in-bits='64' id='type-id-1192'/>
    <reference-type-def kind='rvalue' type-id='type-id-26' size-in-bits='64' id='type-id-1193'/>
    <reference-type-def kind='lvalue' type-id='type-id-27' size-in-bits='64' id='type-id-1194'/>
    <reference-type-def kind='rvalue' type-id='type-id-27' size-in-bits='64' id='type-id-1195'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-1196'/>
    <reference-type-def kind='rvalue' type-id='type-id-626' size-in-bits='64' id='type-id-1197'/>
    <pointer-type-def type-id='type-id-626' size-in-bits='64' id='type-id-1198'/>
    <qualified-type-def type-id='type-id-1198' const='yes' id='type-id-1199'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-1200'/>
    <reference-type-def kind='rvalue' type-id='type-id-629' size-in-bits='64' id='type-id-1201'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' id='type-id-1202'/>
    <reference-type-def kind='lvalue' type-id='type-id-632' size-in-bits='64' id='type-id-1203'/>
    <reference-type-def kind='rvalue' type-id='type-id-632' size-in-bits='64' id='type-id-1204'/>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' id='type-id-1205'/>
    <qualified-type-def type-id='type-id-1205' const='yes' id='type-id-1206'/>
    <reference-type-def kind='lvalue' type-id='type-id-635' size-in-bits='64' id='type-id-1207'/>
    <reference-type-def kind='rvalue' type-id='type-id-635' size-in-bits='64' id='type-id-1208'/>
    <pointer-type-def type-id='type-id-635' size-in-bits='64' id='type-id-1209'/>
    <reference-type-def kind='lvalue' type-id='type-id-638' size-in-bits='64' id='type-id-1210'/>
    <reference-type-def kind='rvalue' type-id='type-id-638' size-in-bits='64' id='type-id-1211'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-1212'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-1213'/>
    <reference-type-def kind='rvalue' type-id='type-id-641' size-in-bits='64' id='type-id-1214'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-1215'/>
    <qualified-type-def type-id='type-id-1215' const='yes' id='type-id-1216'/>
    <reference-type-def kind='lvalue' type-id='type-id-644' size-in-bits='64' id='type-id-1217'/>
    <reference-type-def kind='rvalue' type-id='type-id-644' size-in-bits='64' id='type-id-1218'/>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' id='type-id-1219'/>
    <qualified-type-def type-id='type-id-1219' const='yes' id='type-id-1220'/>
    <pointer-type-def type-id='type-id-1221' size-in-bits='64' id='type-id-1222'/>
    <reference-type-def kind='lvalue' type-id='type-id-647' size-in-bits='64' id='type-id-1223'/>
    <reference-type-def kind='rvalue' type-id='type-id-647' size-in-bits='64' id='type-id-1224'/>
    <pointer-type-def type-id='type-id-647' size-in-bits='64' id='type-id-1225'/>
    <qualified-type-def type-id='type-id-1225' const='yes' id='type-id-1226'/>
    <pointer-type-def type-id='type-id-650' size-in-bits='64' id='type-id-1227'/>
    <qualified-type-def type-id='type-id-1227' const='yes' id='type-id-1228'/>
    <pointer-type-def type-id='type-id-1229' size-in-bits='64' id='type-id-1230'/>
    <qualified-type-def type-id='type-id-1230' const='yes' id='type-id-1231'/>
    <reference-type-def kind='lvalue' type-id='type-id-654' size-in-bits='64' id='type-id-1232'/>
    <reference-type-def kind='rvalue' type-id='type-id-654' size-in-bits='64' id='type-id-1233'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-1234'/>
    <qualified-type-def type-id='type-id-1234' const='yes' id='type-id-1235'/>
    <pointer-type-def type-id='type-id-1236' size-in-bits='64' id='type-id-1237'/>
    <reference-type-def kind='rvalue' type-id='type-id-658' size-in-bits='64' id='type-id-1238'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-1239'/>
    <qualified-type-def type-id='type-id-1239' const='yes' id='type-id-1240'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-1241'/>
    <reference-type-def kind='rvalue' type-id='type-id-662' size-in-bits='64' id='type-id-1242'/>
    <reference-type-def kind='rvalue' type-id='type-id-1243' size-in-bits='64' id='type-id-1244'/>
    <pointer-type-def type-id='type-id-1243' size-in-bits='64' id='type-id-1245'/>
    <qualified-type-def type-id='type-id-1245' const='yes' id='type-id-1246'/>
    <reference-type-def kind='lvalue' type-id='type-id-665' size-in-bits='64' id='type-id-1247'/>
    <reference-type-def kind='rvalue' type-id='type-id-665' size-in-bits='64' id='type-id-1248'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' id='type-id-1249'/>
    <qualified-type-def type-id='type-id-1249' const='yes' id='type-id-1250'/>
    <reference-type-def kind='lvalue' type-id='type-id-671' size-in-bits='64' id='type-id-1251'/>
    <reference-type-def kind='rvalue' type-id='type-id-671' size-in-bits='64' id='type-id-1252'/>
    <pointer-type-def type-id='type-id-671' size-in-bits='64' id='type-id-1253'/>
    <qualified-type-def type-id='type-id-1253' const='yes' id='type-id-1254'/>
    <pointer-type-def type-id='type-id-1255' size-in-bits='64' id='type-id-1256'/>
    <qualified-type-def type-id='type-id-1256' const='yes' id='type-id-1257'/>
    <pointer-type-def type-id='type-id-1258' size-in-bits='64' id='type-id-1259'/>
    <qualified-type-def type-id='type-id-1259' const='yes' id='type-id-1260'/>
    <reference-type-def kind='lvalue' type-id='type-id-676' size-in-bits='64' id='type-id-1261'/>
    <reference-type-def kind='lvalue' type-id='type-id-679' size-in-bits='64' id='type-id-1262'/>
    <pointer-type-def type-id='type-id-681' size-in-bits='64' id='type-id-1263'/>
    <qualified-type-def type-id='type-id-1263' const='yes' id='type-id-1264'/>
    <reference-type-def kind='lvalue' type-id='type-id-685' size-in-bits='64' id='type-id-1265'/>
    <reference-type-def kind='rvalue' type-id='type-id-685' size-in-bits='64' id='type-id-1266'/>
    <pointer-type-def type-id='type-id-685' size-in-bits='64' id='type-id-1267'/>
    <reference-type-def kind='lvalue' type-id='type-id-688' size-in-bits='64' id='type-id-1268'/>
    <reference-type-def kind='rvalue' type-id='type-id-688' size-in-bits='64' id='type-id-1269'/>
    <pointer-type-def type-id='type-id-688' size-in-bits='64' id='type-id-1270'/>
    <reference-type-def kind='lvalue' type-id='type-id-691' size-in-bits='64' id='type-id-1271'/>
    <reference-type-def kind='rvalue' type-id='type-id-691' size-in-bits='64' id='type-id-1272'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-1273'/>
    <reference-type-def kind='lvalue' type-id='type-id-694' size-in-bits='64' id='type-id-1274'/>
    <reference-type-def kind='rvalue' type-id='type-id-694' size-in-bits='64' id='type-id-1275'/>
    <pointer-type-def type-id='type-id-694' size-in-bits='64' id='type-id-1276'/>
    <reference-type-def kind='lvalue' type-id='type-id-697' size-in-bits='64' id='type-id-1277'/>
    <reference-type-def kind='rvalue' type-id='type-id-697' size-in-bits='64' id='type-id-1278'/>
    <pointer-type-def type-id='type-id-697' size-in-bits='64' id='type-id-1279'/>
    <reference-type-def kind='lvalue' type-id='type-id-700' size-in-bits='64' id='type-id-1280'/>
    <reference-type-def kind='rvalue' type-id='type-id-700' size-in-bits='64' id='type-id-1281'/>
    <pointer-type-def type-id='type-id-700' size-in-bits='64' id='type-id-1282'/>
    <reference-type-def kind='lvalue' type-id='type-id-703' size-in-bits='64' id='type-id-1283'/>
    <reference-type-def kind='rvalue' type-id='type-id-703' size-in-bits='64' id='type-id-1284'/>
    <pointer-type-def type-id='type-id-703' size-in-bits='64' id='type-id-1285'/>
    <reference-type-def kind='lvalue' type-id='type-id-706' size-in-bits='64' id='type-id-1286'/>
    <reference-type-def kind='rvalue' type-id='type-id-706' size-in-bits='64' id='type-id-1287'/>
    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-1288'/>
    <reference-type-def kind='lvalue' type-id='type-id-709' size-in-bits='64' id='type-id-1289'/>
    <reference-type-def kind='rvalue' type-id='type-id-709' size-in-bits='64' id='type-id-1290'/>
    <pointer-type-def type-id='type-id-709' size-in-bits='64' id='type-id-1291'/>
    <reference-type-def kind='lvalue' type-id='type-id-712' size-in-bits='64' id='type-id-1292'/>
    <reference-type-def kind='rvalue' type-id='type-id-712' size-in-bits='64' id='type-id-1293'/>
    <pointer-type-def type-id='type-id-712' size-in-bits='64' id='type-id-1294'/>
    <reference-type-def kind='lvalue' type-id='type-id-715' size-in-bits='64' id='type-id-1295'/>
    <reference-type-def kind='rvalue' type-id='type-id-715' size-in-bits='64' id='type-id-1296'/>
    <pointer-type-def type-id='type-id-715' size-in-bits='64' id='type-id-1297'/>
    <reference-type-def kind='lvalue' type-id='type-id-718' size-in-bits='64' id='type-id-1298'/>
    <reference-type-def kind='rvalue' type-id='type-id-718' size-in-bits='64' id='type-id-1299'/>
    <pointer-type-def type-id='type-id-718' size-in-bits='64' id='type-id-1300'/>
    <reference-type-def kind='lvalue' type-id='type-id-721' size-in-bits='64' id='type-id-1301'/>
    <reference-type-def kind='rvalue' type-id='type-id-721' size-in-bits='64' id='type-id-1302'/>
    <pointer-type-def type-id='type-id-721' size-in-bits='64' id='type-id-1303'/>
    <reference-type-def kind='lvalue' type-id='type-id-724' size-in-bits='64' id='type-id-1304'/>
    <reference-type-def kind='rvalue' type-id='type-id-724' size-in-bits='64' id='type-id-1305'/>
    <pointer-type-def type-id='type-id-724' size-in-bits='64' id='type-id-1306'/>
    <reference-type-def kind='lvalue' type-id='type-id-727' size-in-bits='64' id='type-id-1307'/>
    <reference-type-def kind='rvalue' type-id='type-id-727' size-in-bits='64' id='type-id-1308'/>
    <pointer-type-def type-id='type-id-727' size-in-bits='64' id='type-id-1309'/>
    <reference-type-def kind='lvalue' type-id='type-id-730' size-in-bits='64' id='type-id-1310'/>
    <reference-type-def kind='rvalue' type-id='type-id-730' size-in-bits='64' id='type-id-1311'/>
    <pointer-type-def type-id='type-id-730' size-in-bits='64' id='type-id-1312'/>
    <reference-type-def kind='lvalue' type-id='type-id-733' size-in-bits='64' id='type-id-1313'/>
    <reference-type-def kind='rvalue' type-id='type-id-733' size-in-bits='64' id='type-id-1314'/>
    <pointer-type-def type-id='type-id-733' size-in-bits='64' id='type-id-1315'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' id='type-id-1316'/>
    <reference-type-def kind='rvalue' type-id='type-id-736' size-in-bits='64' id='type-id-1317'/>
    <pointer-type-def type-id='type-id-736' size-in-bits='64' id='type-id-1318'/>
    <reference-type-def kind='lvalue' type-id='type-id-739' size-in-bits='64' id='type-id-1319'/>
    <reference-type-def kind='rvalue' type-id='type-id-739' size-in-bits='64' id='type-id-1320'/>
    <pointer-type-def type-id='type-id-739' size-in-bits='64' id='type-id-1321'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-1322'/>
    <reference-type-def kind='rvalue' type-id='type-id-742' size-in-bits='64' id='type-id-1323'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-1324'/>
    <reference-type-def kind='lvalue' type-id='type-id-745' size-in-bits='64' id='type-id-1325'/>
    <reference-type-def kind='rvalue' type-id='type-id-745' size-in-bits='64' id='type-id-1326'/>
    <pointer-type-def type-id='type-id-745' size-in-bits='64' id='type-id-1327'/>
    <reference-type-def kind='lvalue' type-id='type-id-748' size-in-bits='64' id='type-id-1328'/>
    <reference-type-def kind='rvalue' type-id='type-id-748' size-in-bits='64' id='type-id-1329'/>
    <pointer-type-def type-id='type-id-748' size-in-bits='64' id='type-id-1330'/>
    <reference-type-def kind='lvalue' type-id='type-id-751' size-in-bits='64' id='type-id-1331'/>
    <reference-type-def kind='rvalue' type-id='type-id-751' size-in-bits='64' id='type-id-1332'/>
    <pointer-type-def type-id='type-id-751' size-in-bits='64' id='type-id-1333'/>
    <reference-type-def kind='lvalue' type-id='type-id-754' size-in-bits='64' id='type-id-1334'/>
    <reference-type-def kind='rvalue' type-id='type-id-754' size-in-bits='64' id='type-id-1335'/>
    <pointer-type-def type-id='type-id-754' size-in-bits='64' id='type-id-1336'/>
    <pointer-type-def type-id='type-id-817' size-in-bits='64' id='type-id-1337'/>
    <qualified-type-def type-id='type-id-1337' const='yes' id='type-id-1338'/>
    <pointer-type-def type-id='type-id-820' size-in-bits='64' id='type-id-1339'/>
    <qualified-type-def type-id='type-id-1339' const='yes' id='type-id-1340'/>
    <pointer-type-def type-id='type-id-823' size-in-bits='64' id='type-id-1341'/>
    <qualified-type-def type-id='type-id-1341' const='yes' id='type-id-1342'/>
    <pointer-type-def type-id='type-id-826' size-in-bits='64' id='type-id-1343'/>
    <pointer-type-def type-id='type-id-829' size-in-bits='64' id='type-id-1344'/>
    <pointer-type-def type-id='type-id-832' size-in-bits='64' id='type-id-1345'/>
    <qualified-type-def type-id='type-id-1345' const='yes' id='type-id-1346'/>
    <pointer-type-def type-id='type-id-835' size-in-bits='64' id='type-id-1347'/>
    <qualified-type-def type-id='type-id-1347' const='yes' id='type-id-1348'/>
    <pointer-type-def type-id='type-id-838' size-in-bits='64' id='type-id-1349'/>
    <pointer-type-def type-id='type-id-842' size-in-bits='64' id='type-id-1350'/>
    <qualified-type-def type-id='type-id-1350' const='yes' id='type-id-1351'/>
    <pointer-type-def type-id='type-id-845' size-in-bits='64' id='type-id-1352'/>
    <pointer-type-def type-id='type-id-849' size-in-bits='64' id='type-id-1353'/>
    <pointer-type-def type-id='type-id-852' size-in-bits='64' id='type-id-1354'/>
    <pointer-type-def type-id='type-id-855' size-in-bits='64' id='type-id-1355'/>
    <qualified-type-def type-id='type-id-1355' const='yes' id='type-id-1356'/>
    <pointer-type-def type-id='type-id-858' size-in-bits='64' id='type-id-1357'/>
    <qualified-type-def type-id='type-id-1357' const='yes' id='type-id-1358'/>
    <pointer-type-def type-id='type-id-861' size-in-bits='64' id='type-id-1359'/>
    <pointer-type-def type-id='type-id-865' size-in-bits='64' id='type-id-1360'/>
    <pointer-type-def type-id='type-id-869' size-in-bits='64' id='type-id-1361'/>
    <pointer-type-def type-id='type-id-873' size-in-bits='64' id='type-id-1362'/>
    <pointer-type-def type-id='type-id-877' size-in-bits='64' id='type-id-1363'/>
    <pointer-type-def type-id='type-id-881' size-in-bits='64' id='type-id-1364'/>
    <pointer-type-def type-id='type-id-885' size-in-bits='64' id='type-id-1365'/>
    <pointer-type-def type-id='type-id-889' size-in-bits='64' id='type-id-1366'/>
    <pointer-type-def type-id='type-id-893' size-in-bits='64' id='type-id-1367'/>
    <pointer-type-def type-id='type-id-897' size-in-bits='64' id='type-id-1368'/>
    <pointer-type-def type-id='type-id-901' size-in-bits='64' id='type-id-1369'/>
    <pointer-type-def type-id='type-id-905' size-in-bits='64' id='type-id-1370'/>
    <reference-type-def kind='lvalue' type-id='type-id-1371' size-in-bits='64' id='type-id-1372'/>
    <pointer-type-def type-id='type-id-1371' size-in-bits='64' id='type-id-1373'/>
    <reference-type-def kind='lvalue' type-id='type-id-1374' size-in-bits='64' id='type-id-1375'/>
    <pointer-type-def type-id='type-id-1374' size-in-bits='64' id='type-id-1376'/>
    <reference-type-def kind='lvalue' type-id='type-id-1377' size-in-bits='64' id='type-id-1378'/>
    <pointer-type-def type-id='type-id-1377' size-in-bits='64' id='type-id-1379'/>
    <pointer-type-def type-id='type-id-1380' size-in-bits='64' id='type-id-1381'/>
    <pointer-type-def type-id='type-id-1382' size-in-bits='64' id='type-id-1383'/>
    <reference-type-def kind='lvalue' type-id='type-id-1384' size-in-bits='64' id='type-id-1385'/>
    <pointer-type-def type-id='type-id-1384' size-in-bits='64' id='type-id-1386'/>
    <reference-type-def kind='lvalue' type-id='type-id-1387' size-in-bits='64' id='type-id-1388'/>
    <pointer-type-def type-id='type-id-1387' size-in-bits='64' id='type-id-1389'/>
    <pointer-type-def type-id='type-id-909' size-in-bits='64' id='type-id-1390'/>
    <reference-type-def kind='lvalue' type-id='type-id-1391' size-in-bits='64' id='type-id-1392'/>
    <pointer-type-def type-id='type-id-1391' size-in-bits='64' id='type-id-1393'/>
    <pointer-type-def type-id='type-id-912' size-in-bits='64' id='type-id-1394'/>
    <pointer-type-def type-id='type-id-1395' size-in-bits='64' id='type-id-1396'/>
    <pointer-type-def type-id='type-id-1397' size-in-bits='64' id='type-id-1398'/>
    <reference-type-def kind='lvalue' type-id='type-id-1399' size-in-bits='64' id='type-id-1400'/>
    <pointer-type-def type-id='type-id-1399' size-in-bits='64' id='type-id-1401'/>
    <reference-type-def kind='lvalue' type-id='type-id-1402' size-in-bits='64' id='type-id-1403'/>
    <pointer-type-def type-id='type-id-1402' size-in-bits='64' id='type-id-1404'/>
    <pointer-type-def type-id='type-id-915' size-in-bits='64' id='type-id-1405'/>
    <pointer-type-def type-id='type-id-918' size-in-bits='64' id='type-id-1406'/>
    <pointer-type-def type-id='type-id-921' size-in-bits='64' id='type-id-1407'/>
    <pointer-type-def type-id='type-id-924' size-in-bits='64' id='type-id-1408'/>
    <pointer-type-def type-id='type-id-927' size-in-bits='64' id='type-id-1409'/>
    <pointer-type-def type-id='type-id-930' size-in-bits='64' id='type-id-1410'/>
    <pointer-type-def type-id='type-id-933' size-in-bits='64' id='type-id-1411'/>
    <pointer-type-def type-id='type-id-936' size-in-bits='64' id='type-id-1412'/>
    <pointer-type-def type-id='type-id-939' size-in-bits='64' id='type-id-1413'/>
    <pointer-type-def type-id='type-id-942' size-in-bits='64' id='type-id-1414'/>
    <pointer-type-def type-id='type-id-945' size-in-bits='64' id='type-id-1415'/>
    <pointer-type-def type-id='type-id-948' size-in-bits='64' id='type-id-1416'/>
    <reference-type-def kind='lvalue' type-id='type-id-951' size-in-bits='64' id='type-id-1417'/>
    <reference-type-def kind='rvalue' type-id='type-id-951' size-in-bits='64' id='type-id-1418'/>
    <pointer-type-def type-id='type-id-951' size-in-bits='64' id='type-id-1419'/>
    <qualified-type-def type-id='type-id-1419' const='yes' id='type-id-1420'/>
    <reference-type-def kind='lvalue' type-id='type-id-954' size-in-bits='64' id='type-id-1421'/>
    <reference-type-def kind='rvalue' type-id='type-id-954' size-in-bits='64' id='type-id-1422'/>
    <pointer-type-def type-id='type-id-954' size-in-bits='64' id='type-id-1423'/>
    <reference-type-def kind='lvalue' type-id='type-id-957' size-in-bits='64' id='type-id-1424'/>
    <reference-type-def kind='rvalue' type-id='type-id-957' size-in-bits='64' id='type-id-1425'/>
    <pointer-type-def type-id='type-id-957' size-in-bits='64' id='type-id-1426'/>
    <qualified-type-def type-id='type-id-1426' const='yes' id='type-id-1427'/>
    <reference-type-def kind='lvalue' type-id='type-id-960' size-in-bits='64' id='type-id-1428'/>
    <reference-type-def kind='rvalue' type-id='type-id-960' size-in-bits='64' id='type-id-1429'/>
    <pointer-type-def type-id='type-id-960' size-in-bits='64' id='type-id-1430'/>
    <reference-type-def kind='lvalue' type-id='type-id-963' size-in-bits='64' id='type-id-1431'/>
    <reference-type-def kind='rvalue' type-id='type-id-963' size-in-bits='64' id='type-id-1432'/>
    <pointer-type-def type-id='type-id-963' size-in-bits='64' id='type-id-1433'/>
    <reference-type-def kind='lvalue' type-id='type-id-966' size-in-bits='64' id='type-id-1434'/>
    <reference-type-def kind='rvalue' type-id='type-id-966' size-in-bits='64' id='type-id-1435'/>
    <pointer-type-def type-id='type-id-966' size-in-bits='64' id='type-id-1436'/>
    <qualified-type-def type-id='type-id-1436' const='yes' id='type-id-1437'/>
    <reference-type-def kind='lvalue' type-id='type-id-969' size-in-bits='64' id='type-id-1438'/>
    <reference-type-def kind='rvalue' type-id='type-id-969' size-in-bits='64' id='type-id-1439'/>
    <pointer-type-def type-id='type-id-969' size-in-bits='64' id='type-id-1440'/>
    <qualified-type-def type-id='type-id-1440' const='yes' id='type-id-1441'/>
    <reference-type-def kind='lvalue' type-id='type-id-972' size-in-bits='64' id='type-id-1442'/>
    <pointer-type-def type-id='type-id-972' size-in-bits='64' id='type-id-1443'/>
    <qualified-type-def type-id='type-id-1443' const='yes' id='type-id-1444'/>
    <reference-type-def kind='lvalue' type-id='type-id-976' size-in-bits='64' id='type-id-1445'/>
    <pointer-type-def type-id='type-id-976' size-in-bits='64' id='type-id-1446'/>
    <qualified-type-def type-id='type-id-1446' const='yes' id='type-id-1447'/>
    <pointer-type-def type-id='type-id-980' size-in-bits='64' id='type-id-1448'/>
    <pointer-type-def type-id='type-id-983' size-in-bits='64' id='type-id-1449'/>
    <reference-type-def kind='lvalue' type-id='type-id-986' size-in-bits='64' id='type-id-1450'/>
    <pointer-type-def type-id='type-id-986' size-in-bits='64' id='type-id-1451'/>
    <qualified-type-def type-id='type-id-1451' const='yes' id='type-id-1452'/>
    <reference-type-def kind='lvalue' type-id='type-id-990' size-in-bits='64' id='type-id-1453'/>
    <pointer-type-def type-id='type-id-990' size-in-bits='64' id='type-id-1454'/>
    <qualified-type-def type-id='type-id-1454' const='yes' id='type-id-1455'/>
    <pointer-type-def type-id='type-id-994' size-in-bits='64' id='type-id-1456'/>
    <reference-type-def kind='lvalue' type-id='type-id-1010' size-in-bits='64' id='type-id-1457'/>
    <reference-type-def kind='rvalue' type-id='type-id-1010' size-in-bits='64' id='type-id-1458'/>
    <pointer-type-def type-id='type-id-1010' size-in-bits='64' id='type-id-1459'/>
    <reference-type-def kind='lvalue' type-id='type-id-1460' size-in-bits='64' id='type-id-1461'/>
    <reference-type-def kind='lvalue' type-id='type-id-1014' size-in-bits='64' id='type-id-1462'/>
    <pointer-type-def type-id='type-id-1014' size-in-bits='64' id='type-id-1463'/>
    <qualified-type-def type-id='type-id-1463' const='yes' id='type-id-1464'/>
    <reference-type-def kind='lvalue' type-id='type-id-1017' size-in-bits='64' id='type-id-1465'/>
    <reference-type-def kind='rvalue' type-id='type-id-1017' size-in-bits='64' id='type-id-1466'/>
    <pointer-type-def type-id='type-id-1017' size-in-bits='64' id='type-id-1467'/>
    <qualified-type-def type-id='type-id-1467' const='yes' id='type-id-1468'/>
    <reference-type-def kind='lvalue' type-id='type-id-1020' size-in-bits='64' id='type-id-1469'/>
    <reference-type-def kind='lvalue' type-id='type-id-1023' size-in-bits='64' id='type-id-1470'/>
    <pointer-type-def type-id='type-id-1029' size-in-bits='64' id='type-id-1471'/>
    <pointer-type-def type-id='type-id-1032' size-in-bits='64' id='type-id-1472'/>
    <qualified-type-def type-id='type-id-1472' const='yes' id='type-id-1473'/>
    <reference-type-def kind='lvalue' type-id='type-id-1035' size-in-bits='64' id='type-id-1474'/>
    <reference-type-def kind='rvalue' type-id='type-id-1035' size-in-bits='64' id='type-id-1475'/>
    <pointer-type-def type-id='type-id-1035' size-in-bits='64' id='type-id-1476'/>
    <qualified-type-def type-id='type-id-1476' const='yes' id='type-id-1477'/>
    <reference-type-def kind='lvalue' type-id='type-id-1045' size-in-bits='64' id='type-id-1478'/>
    <pointer-type-def type-id='type-id-1045' size-in-bits='64' id='type-id-1479'/>
    <pointer-type-def type-id='type-id-1052' size-in-bits='64' id='type-id-1480'/>
    <pointer-type-def type-id='type-id-1481' size-in-bits='64' id='type-id-1482'/>
    <pointer-type-def type-id='type-id-1483' size-in-bits='64' id='type-id-1484'/>
    <pointer-type-def type-id='type-id-1485' size-in-bits='64' id='type-id-1486'/>
    <pointer-type-def type-id='type-id-1487' size-in-bits='64' id='type-id-1488'/>
    <pointer-type-def type-id='type-id-1489' size-in-bits='64' id='type-id-1490'/>
    <pointer-type-def type-id='type-id-1491' size-in-bits='64' id='type-id-1492'/>
    <pointer-type-def type-id='type-id-1493' size-in-bits='64' id='type-id-1494'/>
    <pointer-type-def type-id='type-id-1495' size-in-bits='64' id='type-id-1496'/>
    <pointer-type-def type-id='type-id-1497' size-in-bits='64' id='type-id-1498'/>
    <pointer-type-def type-id='type-id-1499' size-in-bits='64' id='type-id-1500'/>
    <pointer-type-def type-id='type-id-1501' size-in-bits='64' id='type-id-1502'/>
    <pointer-type-def type-id='type-id-1503' size-in-bits='64' id='type-id-1504'/>
    <pointer-type-def type-id='type-id-1505' size-in-bits='64' id='type-id-1506'/>
    <pointer-type-def type-id='type-id-1507' size-in-bits='64' id='type-id-1508'/>
    <pointer-type-def type-id='type-id-1509' size-in-bits='64' id='type-id-1510'/>
    <pointer-type-def type-id='type-id-1055' size-in-bits='64' id='type-id-1511'/>
    <pointer-type-def type-id='type-id-1058' size-in-bits='64' id='type-id-1512'/>
    <pointer-type-def type-id='type-id-1062' size-in-bits='64' id='type-id-1513'/>
    <pointer-type-def type-id='type-id-1065' size-in-bits='64' id='type-id-1514'/>
    <pointer-type-def type-id='type-id-1515' size-in-bits='64' id='type-id-1516'/>
    <reference-type-def kind='lvalue' type-id='type-id-1084' size-in-bits='64' id='type-id-1517'/>
    <pointer-type-def type-id='type-id-1084' size-in-bits='64' id='type-id-1518'/>
    <qualified-type-def type-id='type-id-1518' const='yes' id='type-id-1519'/>
    <reference-type-def kind='lvalue' type-id='type-id-1520' size-in-bits='64' id='type-id-1521'/>
    <reference-type-def kind='rvalue' type-id='type-id-1520' size-in-bits='64' id='type-id-1522'/>
    <reference-type-def kind='lvalue' type-id='type-id-1523' size-in-bits='64' id='type-id-1524'/>
    <reference-type-def kind='rvalue' type-id='type-id-1525' size-in-bits='64' id='type-id-1526'/>
    <reference-type-def kind='lvalue' type-id='type-id-1527' size-in-bits='64' id='type-id-1528'/>
    <reference-type-def kind='rvalue' type-id='type-id-1529' size-in-bits='64' id='type-id-1530'/>
    <reference-type-def kind='lvalue' type-id='type-id-1531' size-in-bits='64' id='type-id-1532'/>
    <reference-type-def kind='lvalue' type-id='type-id-1533' size-in-bits='64' id='type-id-1534'/>
    <reference-type-def kind='lvalue' type-id='type-id-1535' size-in-bits='64' id='type-id-1536'/>
    <reference-type-def kind='rvalue' type-id='type-id-1537' size-in-bits='64' id='type-id-1538'/>
    <reference-type-def kind='rvalue' type-id='type-id-1539' size-in-bits='64' id='type-id-1540'/>
    <reference-type-def kind='lvalue' type-id='type-id-1541' size-in-bits='64' id='type-id-1542'/>
    <reference-type-def kind='lvalue' type-id='type-id-1543' size-in-bits='64' id='type-id-1544'/>
    <reference-type-def kind='rvalue' type-id='type-id-1543' size-in-bits='64' id='type-id-1545'/>
    <reference-type-def kind='lvalue' type-id='type-id-1546' size-in-bits='64' id='type-id-1547'/>
    <reference-type-def kind='lvalue' type-id='type-id-1548' size-in-bits='64' id='type-id-1549'/>
    <reference-type-def kind='lvalue' type-id='type-id-1550' size-in-bits='64' id='type-id-1551'/>
    <reference-type-def kind='lvalue' type-id='type-id-1552' size-in-bits='64' id='type-id-1553'/>
    <reference-type-def kind='lvalue' type-id='type-id-1554' size-in-bits='64' id='type-id-1555'/>
    <reference-type-def kind='rvalue' type-id='type-id-1556' size-in-bits='64' id='type-id-1557'/>
    <reference-type-def kind='lvalue' type-id='type-id-1558' size-in-bits='64' id='type-id-1559'/>
    <reference-type-def kind='lvalue' type-id='type-id-1560' size-in-bits='64' id='type-id-1561'/>
    <reference-type-def kind='rvalue' type-id='type-id-1560' size-in-bits='64' id='type-id-1562'/>
    <reference-type-def kind='lvalue' type-id='type-id-1563' size-in-bits='64' id='type-id-1564'/>
    <reference-type-def kind='lvalue' type-id='type-id-1565' size-in-bits='64' id='type-id-1566'/>
    <reference-type-def kind='rvalue' type-id='type-id-1565' size-in-bits='64' id='type-id-1567'/>
    <reference-type-def kind='lvalue' type-id='type-id-1568' size-in-bits='64' id='type-id-1569'/>
    <reference-type-def kind='lvalue' type-id='type-id-1570' size-in-bits='64' id='type-id-1571'/>
    <reference-type-def kind='lvalue' type-id='type-id-1572' size-in-bits='64' id='type-id-1573'/>
    <reference-type-def kind='lvalue' type-id='type-id-1574' size-in-bits='64' id='type-id-1575'/>
    <reference-type-def kind='lvalue' type-id='type-id-1576' size-in-bits='64' id='type-id-1577'/>
    <reference-type-def kind='lvalue' type-id='type-id-1578' size-in-bits='64' id='type-id-1579'/>
    <reference-type-def kind='lvalue' type-id='type-id-1580' size-in-bits='64' id='type-id-1581'/>
    <reference-type-def kind='lvalue' type-id='type-id-1582' size-in-bits='64' id='type-id-1583'/>
    <reference-type-def kind='lvalue' type-id='type-id-1584' size-in-bits='64' id='type-id-1585'/>
    <reference-type-def kind='lvalue' type-id='type-id-1586' size-in-bits='64' id='type-id-1587'/>
    <reference-type-def kind='lvalue' type-id='type-id-1588' size-in-bits='64' id='type-id-1589'/>
    <reference-type-def kind='lvalue' type-id='type-id-1590' size-in-bits='64' id='type-id-1591'/>
    <reference-type-def kind='lvalue' type-id='type-id-1592' size-in-bits='64' id='type-id-1593'/>
    <reference-type-def kind='lvalue' type-id='type-id-1594' size-in-bits='64' id='type-id-1595'/>
    <reference-type-def kind='lvalue' type-id='type-id-1596' size-in-bits='64' id='type-id-1597'/>
    <reference-type-def kind='lvalue' type-id='type-id-1598' size-in-bits='64' id='type-id-1599'/>
    <reference-type-def kind='lvalue' type-id='type-id-1600' size-in-bits='64' id='type-id-1601'/>
    <reference-type-def kind='lvalue' type-id='type-id-1602' size-in-bits='64' id='type-id-1603'/>
    <reference-type-def kind='lvalue' type-id='type-id-1604' size-in-bits='64' id='type-id-1605'/>
    <reference-type-def kind='lvalue' type-id='type-id-1606' size-in-bits='64' id='type-id-1607'/>
    <reference-type-def kind='lvalue' type-id='type-id-1608' size-in-bits='64' id='type-id-1609'/>
    <reference-type-def kind='lvalue' type-id='type-id-1610' size-in-bits='64' id='type-id-1611'/>
    <reference-type-def kind='lvalue' type-id='type-id-1612' size-in-bits='64' id='type-id-1613'/>
    <reference-type-def kind='lvalue' type-id='type-id-1614' size-in-bits='64' id='type-id-1615'/>
    <reference-type-def kind='lvalue' type-id='type-id-1616' size-in-bits='64' id='type-id-1617'/>
    <reference-type-def kind='lvalue' type-id='type-id-1618' size-in-bits='64' id='type-id-1619'/>
    <reference-type-def kind='lvalue' type-id='type-id-1620' size-in-bits='64' id='type-id-1621'/>
    <reference-type-def kind='lvalue' type-id='type-id-1622' size-in-bits='64' id='type-id-1623'/>
    <reference-type-def kind='lvalue' type-id='type-id-1624' size-in-bits='64' id='type-id-1625'/>
    <reference-type-def kind='lvalue' type-id='type-id-1626' size-in-bits='64' id='type-id-1627'/>
    <reference-type-def kind='rvalue' type-id='type-id-1626' size-in-bits='64' id='type-id-1628'/>
    <reference-type-def kind='lvalue' type-id='type-id-1629' size-in-bits='64' id='type-id-1630'/>
    <reference-type-def kind='lvalue' type-id='type-id-1631' size-in-bits='64' id='type-id-1632'/>
    <reference-type-def kind='lvalue' type-id='type-id-1633' size-in-bits='64' id='type-id-1634'/>
    <reference-type-def kind='lvalue' type-id='type-id-1635' size-in-bits='64' id='type-id-1636'/>
    <reference-type-def kind='lvalue' type-id='type-id-1637' size-in-bits='64' id='type-id-1638'/>
    <reference-type-def kind='lvalue' type-id='type-id-1639' size-in-bits='64' id='type-id-1640'/>
    <reference-type-def kind='lvalue' type-id='type-id-1641' size-in-bits='64' id='type-id-1642'/>
    <reference-type-def kind='lvalue' type-id='type-id-1643' size-in-bits='64' id='type-id-1644'/>
    <reference-type-def kind='rvalue' type-id='type-id-1645' size-in-bits='64' id='type-id-1646'/>
    <reference-type-def kind='lvalue' type-id='type-id-1647' size-in-bits='64' id='type-id-1648'/>
    <reference-type-def kind='lvalue' type-id='type-id-1649' size-in-bits='64' id='type-id-1650'/>
    <reference-type-def kind='lvalue' type-id='type-id-1651' size-in-bits='64' id='type-id-1652'/>
    <reference-type-def kind='lvalue' type-id='type-id-1653' size-in-bits='64' id='type-id-1654'/>
    <reference-type-def kind='lvalue' type-id='type-id-1655' size-in-bits='64' id='type-id-1656'/>
    <reference-type-def kind='lvalue' type-id='type-id-1657' size-in-bits='64' id='type-id-1658'/>
    <reference-type-def kind='lvalue' type-id='type-id-1090' size-in-bits='64' id='type-id-1659'/>
    <pointer-type-def type-id='type-id-1090' size-in-bits='64' id='type-id-1660'/>
    <qualified-type-def type-id='type-id-1660' const='yes' id='type-id-1661'/>
    <reference-type-def kind='lvalue' type-id='type-id-1662' size-in-bits='64' id='type-id-1663'/>
    <reference-type-def kind='lvalue' type-id='type-id-1095' size-in-bits='64' id='type-id-1664'/>
    <pointer-type-def type-id='type-id-1095' size-in-bits='64' id='type-id-1665'/>
    <qualified-type-def type-id='type-id-1665' const='yes' id='type-id-1666'/>
    <reference-type-def kind='lvalue' type-id='type-id-1667' size-in-bits='64' id='type-id-1668'/>
    <reference-type-def kind='lvalue' type-id='type-id-1103' size-in-bits='64' id='type-id-1669'/>
    <reference-type-def kind='rvalue' type-id='type-id-1103' size-in-bits='64' id='type-id-1670'/>
    <pointer-type-def type-id='type-id-1103' size-in-bits='64' id='type-id-1671'/>
    <qualified-type-def type-id='type-id-1671' const='yes' id='type-id-1672'/>
    <reference-type-def kind='lvalue' type-id='type-id-1108' size-in-bits='64' id='type-id-1673'/>
    <reference-type-def kind='rvalue' type-id='type-id-1108' size-in-bits='64' id='type-id-1674'/>
    <pointer-type-def type-id='type-id-1108' size-in-bits='64' id='type-id-1675'/>
    <reference-type-def kind='lvalue' type-id='type-id-1113' size-in-bits='64' id='type-id-1676'/>
    <reference-type-def kind='rvalue' type-id='type-id-1113' size-in-bits='64' id='type-id-1677'/>
    <pointer-type-def type-id='type-id-1113' size-in-bits='64' id='type-id-1678'/>
    <qualified-type-def type-id='type-id-1678' const='yes' id='type-id-1679'/>
    <reference-type-def kind='lvalue' type-id='type-id-1118' size-in-bits='64' id='type-id-1680'/>
    <reference-type-def kind='rvalue' type-id='type-id-1118' size-in-bits='64' id='type-id-1681'/>
    <pointer-type-def type-id='type-id-1118' size-in-bits='64' id='type-id-1682'/>
    <reference-type-def kind='lvalue' type-id='type-id-1122' size-in-bits='64' id='type-id-1683'/>
    <reference-type-def kind='rvalue' type-id='type-id-1122' size-in-bits='64' id='type-id-1684'/>
    <pointer-type-def type-id='type-id-1122' size-in-bits='64' id='type-id-1685'/>
    <reference-type-def kind='lvalue' type-id='type-id-1126' size-in-bits='64' id='type-id-1686'/>
    <reference-type-def kind='rvalue' type-id='type-id-1126' size-in-bits='64' id='type-id-1687'/>
    <pointer-type-def type-id='type-id-1126' size-in-bits='64' id='type-id-1688'/>
    <qualified-type-def type-id='type-id-1688' const='yes' id='type-id-1689'/>
    <reference-type-def kind='lvalue' type-id='type-id-1131' size-in-bits='64' id='type-id-1690'/>
    <reference-type-def kind='rvalue' type-id='type-id-1131' size-in-bits='64' id='type-id-1691'/>
    <pointer-type-def type-id='type-id-1131' size-in-bits='64' id='type-id-1692'/>
    <qualified-type-def type-id='type-id-1692' const='yes' id='type-id-1693'/>
    <reference-type-def kind='lvalue' type-id='type-id-1694' size-in-bits='64' id='type-id-1695'/>
    <reference-type-def kind='lvalue' type-id='type-id-1136' size-in-bits='64' id='type-id-1696'/>
    <reference-type-def kind='rvalue' type-id='type-id-1136' size-in-bits='64' id='type-id-1697'/>
    <pointer-type-def type-id='type-id-1136' size-in-bits='64' id='type-id-1698'/>
    <qualified-type-def type-id='type-id-1698' const='yes' id='type-id-1699'/>
    <reference-type-def kind='lvalue' type-id='type-id-1141' size-in-bits='64' id='type-id-1700'/>
    <reference-type-def kind='rvalue' type-id='type-id-1149' size-in-bits='64' id='type-id-1701'/>
    <pointer-type-def type-id='type-id-1702' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-1703' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-1704'/>
    <pointer-type-def type-id='type-id-1705' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-1706'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-1707'/>
    <reference-type-def kind='rvalue' type-id='type-id-44' size-in-bits='64' id='type-id-1708'/>
    <reference-type-def kind='lvalue' type-id='type-id-17' size-in-bits='64' id='type-id-1709'/>
    <reference-type-def kind='rvalue' type-id='type-id-17' size-in-bits='64' id='type-id-1710'/>
    <reference-type-def kind='lvalue' type-id='type-id-4' size-in-bits='64' id='type-id-1711'/>
    <reference-type-def kind='rvalue' type-id='type-id-4' size-in-bits='64' id='type-id-1712'/>
    <reference-type-def kind='lvalue' type-id='type-id-46' size-in-bits='64' id='type-id-1713'/>
    <reference-type-def kind='rvalue' type-id='type-id-46' size-in-bits='64' id='type-id-1714'/>
    <pointer-type-def type-id='type-id-1715' size-in-bits='64' id='type-id-1716'/>
    <pointer-type-def type-id='type-id-1717' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-1718' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-1719' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-1720' size-in-bits='64' id='type-id-1721'/>
    <qualified-type-def type-id='type-id-1721' const='yes' id='type-id-1722'/>
    <reference-type-def kind='lvalue' type-id='type-id-1722' size-in-bits='64' id='type-id-1723'/>
    <pointer-type-def type-id='type-id-1724' size-in-bits='64' id='type-id-1725'/>
    <qualified-type-def type-id='type-id-1725' const='yes' id='type-id-1726'/>
    <reference-type-def kind='lvalue' type-id='type-id-1726' size-in-bits='64' id='type-id-1727'/>
    <pointer-type-def type-id='type-id-1728' size-in-bits='64' id='type-id-1729'/>
    <qualified-type-def type-id='type-id-1729' const='yes' id='type-id-1730'/>
    <reference-type-def kind='lvalue' type-id='type-id-1730' size-in-bits='64' id='type-id-1731'/>
    <pointer-type-def type-id='type-id-1732' size-in-bits='64' id='type-id-1733'/>
    <qualified-type-def type-id='type-id-1733' const='yes' id='type-id-1734'/>
    <reference-type-def kind='lvalue' type-id='type-id-1734' size-in-bits='64' id='type-id-1735'/>
    <pointer-type-def type-id='type-id-1736' size-in-bits='64' id='type-id-1737'/>
    <qualified-type-def type-id='type-id-1737' const='yes' id='type-id-1738'/>
    <reference-type-def kind='lvalue' type-id='type-id-1738' size-in-bits='64' id='type-id-1739'/>
    <pointer-type-def type-id='type-id-1740' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-1741' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-1742' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-1743' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-1744' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-1745' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-1746' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-1747'/>
    <pointer-type-def type-id='type-id-1747' size-in-bits='64' id='type-id-1748'/>
    <class-decl name='PJ_dialog_vtable_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-506'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-329'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-330'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-331'/>
    <namespace-decl name='PJ'>
      <class-decl name='Unexpected&lt;std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='256' visibility='default' id='type-id-277'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='error_' type-id='type-id-671' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='320' visibility='default' id='type-id-224'>
        <member-type access='private'>
          <class-decl name='ErrorStorage' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-228'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='value' type-id='type-id-671' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='storage_' type-id='type-id-1103' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='320' visibility='default' id='type-id-233'>
        <member-type access='private'>
          <class-decl name='ErrorStorage' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-237'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='value' type-id='type-id-671' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='storage_' type-id='type-id-1113' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='Expected&lt;PJ_field_handle_t, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='320' visibility='default' id='type-id-242'>
        <member-type access='private'>
          <class-decl name='ErrorStorage' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-244'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='value' type-id='type-id-671' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='storage_' type-id='type-id-1118' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='Expected&lt;PJ_object_topic_handle_t, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='320' visibility='default' id='type-id-248'>
        <member-type access='private'>
          <class-decl name='ErrorStorage' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-250'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='value' type-id='type-id-671' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='storage_' type-id='type-id-1122' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='Expected&lt;PJ_parser_binding_handle_t, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='320' visibility='default' id='type-id-254'>
        <member-type access='private'>
          <class-decl name='ErrorStorage' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-257'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='value' type-id='type-id-671' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='storage_' type-id='type-id-1126' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='Expected&lt;PJ_topic_handle_t, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='320' visibility='default' id='type-id-262'>
        <member-type access='private'>
          <class-decl name='ErrorStorage' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-265'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='value' type-id='type-id-671' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='storage_' type-id='type-id-1131' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='Expected&lt;void, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='320' visibility='default' id='type-id-270'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='error_' type-id='type-id-671' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='has_error_' type-id='type-id-1' visibility='default'/>
        </data-member>
      </class-decl>
      <typedef-decl name='Status' type-id='type-id-270' id='type-id-1749'/>
      <enum-decl name='DataSourceState' id='type-id-1750'>
        <underlying-type type-id='type-id-42'/>
        <enumerator name='kIdle' value='0'/>
        <enumerator name='kConfiguring' value='1'/>
        <enumerator name='kStarting' value='2'/>
        <enumerator name='kRunning' value='3'/>
        <enumerator name='kPaused' value='4'/>
        <enumerator name='kStopping' value='5'/>
        <enumerator name='kStopped' value='6'/>
        <enumerator name='kFailed' value='7'/>
      </enum-decl>
      <enum-decl name='DataSourceMessageLevel' id='type-id-1751'>
        <underlying-type type-id='type-id-42'/>
        <enumerator name='kInfo' value='0'/>
        <enumerator name='kWarning' value='1'/>
        <enumerator name='kError' value='2'/>
      </enum-decl>
      <enum-decl name='MessageBoxType' id='type-id-1752'>
        <underlying-type type-id='type-id-42'/>
        <enumerator name='kInfo' value='0'/>
        <enumerator name='kWarning' value='1'/>
        <enumerator name='kError' value='2'/>
        <enumerator name='kQuestion' value='3'/>
      </enum-decl>
      <enum-decl name='MessageBoxButton' id='type-id-1753'>
        <underlying-type type-id='type-id-42'/>
        <enumerator name='kOk' value='1'/>
        <enumerator name='kCancel' value='2'/>
        <enumerator name='kYes' value='4'/>
        <enumerator name='kNo' value='8'/>
        <enumerator name='kContinue' value='16'/>
        <enumerator name='kAbort' value='32'/>
        <enumerator name='kRetry' value='64'/>
        <enumerator name='kIgnore' value='128'/>
      </enum-decl>
      <typedef-decl name='ParserBindingHandle' type-id='type-id-56' id='type-id-1754'/>
      <class-decl name='ParserBindingRequest' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-463'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='topic_name' type-id='type-id-1755' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='parser_encoding' type-id='type-id-1755' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='type_name' type-id='type-id-1755' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='schema' type-id='type-id-1756' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='parser_config_json' type-id='type-id-1755' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='DataSourceRuntimeHostView' size-in-bits='128' visibility='default' id='type-id-219'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='host_' type-id='type-id-86' visibility='default'/>
        </data-member>
        <member-function access='public' const='yes'>
          <function-decl name='ensureParserBinding' mangled-name='_ZNK2PJ25DataSourceRuntimeHostView19ensureParserBindingB5cxx11ERKNS_20ParserBindingRequestE' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK2PJ25DataSourceRuntimeHostView19ensureParserBindingB5cxx11ERKNS_20ParserBindingRequestE'>
            <parameter type-id='type-id-416' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-465' name='request'/>
            <return type-id='type-id-254'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='DataSourcePluginBase' size-in-bits='832' visibility='default' id='type-id-217'>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='service_registry_' type-id='type-id-284' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='write_host_view_' type-id='type-id-292' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='object_write_host_view_' type-id='type-id-287' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='runtime_host_view_' type-id='type-id-219' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='576'>
          <var-decl name='config_buf_' type-id='type-id-1757' visibility='default'/>
        </data-member>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_get_plugin_extension' mangled-name='_ZN2PJ20DataSourcePluginBase31trampoline_get_plugin_extensionEPv16PJ_string_view_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase31trampoline_get_plugin_extensionEPv16PJ_string_view_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-71'/>
            <return type-id='type-id-18'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_get_dialog' mangled-name='_ZN2PJ20DataSourcePluginBase21trampoline_get_dialogEPv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase21trampoline_get_dialogEPv'>
            <parameter type-id='type-id-18'/>
            <return type-id='type-id-137'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_current_state' mangled-name='_ZN2PJ20DataSourcePluginBase24trampoline_current_stateEPv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase24trampoline_current_stateEPv'>
            <parameter type-id='type-id-18'/>
            <return type-id='type-id-50'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_poll' mangled-name='_ZN2PJ20DataSourcePluginBase15trampoline_pollEPvP10PJ_error_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase15trampoline_pollEPvP10PJ_error_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-306'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_resume' mangled-name='_ZN2PJ20DataSourcePluginBase17trampoline_resumeEPvP10PJ_error_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase17trampoline_resumeEPvP10PJ_error_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-306'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_pause' mangled-name='_ZN2PJ20DataSourcePluginBase16trampoline_pauseEPvP10PJ_error_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase16trampoline_pauseEPvP10PJ_error_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-306'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_stop' mangled-name='_ZN2PJ20DataSourcePluginBase15trampoline_stopEPv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase15trampoline_stopEPv'>
            <parameter type-id='type-id-18'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_start' mangled-name='_ZN2PJ20DataSourcePluginBase16trampoline_startEPvP10PJ_error_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase16trampoline_startEPvP10PJ_error_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-306'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_load_config' mangled-name='_ZN2PJ20DataSourcePluginBase22trampoline_load_configEPv16PJ_string_view_tP10PJ_error_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase22trampoline_load_configEPv16PJ_string_view_tP10PJ_error_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-71'/>
            <parameter type-id='type-id-306'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_save_config' mangled-name='_ZN2PJ20DataSourcePluginBase22trampoline_save_configEPvP16PJ_string_view_tP10PJ_error_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase22trampoline_save_configEPvP16PJ_string_view_tP10PJ_error_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-325'/>
            <parameter type-id='type-id-306'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_bind' mangled-name='_ZN2PJ20DataSourcePluginBase15trampoline_bindEPv21PJ_service_registry_tP10PJ_error_t' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase15trampoline_bindEPv21PJ_service_registry_tP10PJ_error_t'>
            <parameter type-id='type-id-18'/>
            <parameter type-id='type-id-134'/>
            <parameter type-id='type-id-306'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_capabilities' mangled-name='_ZN2PJ20DataSourcePluginBase23trampoline_capabilitiesEPv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase23trampoline_capabilitiesEPv'>
            <parameter type-id='type-id-18'/>
            <return type-id='type-id-64'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='trampoline_destroy' mangled-name='_ZN2PJ20DataSourcePluginBase18trampoline_destroyEPv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase18trampoline_destroyEPv'>
            <parameter type-id='type-id-18'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~DataSourcePluginBase' mangled-name='_ZN2PJ20DataSourcePluginBaseD0Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~DataSourcePluginBase' mangled-name='_ZN2PJ20DataSourcePluginBaseD2Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~DataSourcePluginBase' mangled-name='_ZN2PJ20DataSourcePluginBaseD4Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='2'>
          <function-decl name='capabilities' mangled-name='_ZNK2PJ20DataSourcePluginBase12capabilitiesEv' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-410' is-artificial='yes'/>
            <return type-id='type-id-64'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='bind' mangled-name='_ZN2PJ20DataSourcePluginBase4bindB5cxx11ENS_3sdk15ServiceRegistryE' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase4bindB5cxx11ENS_3sdk15ServiceRegistryE'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <parameter type-id='type-id-284'/>
            <return type-id='type-id-1749'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='4'>
          <function-decl name='saveConfig' mangled-name='_ZNK2PJ20DataSourcePluginBase10saveConfigB5cxx11Ev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK2PJ20DataSourcePluginBase10saveConfigB5cxx11Ev'>
            <parameter type-id='type-id-410' is-artificial='yes'/>
            <return type-id='type-id-1757'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='loadConfig' mangled-name='_ZN2PJ20DataSourcePluginBase10loadConfigB5cxx11ESt17basic_string_viewIcSt11char_traitsIcEE' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase10loadConfigB5cxx11ESt17basic_string_viewIcSt11char_traitsIcEE'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <parameter type-id='type-id-1755'/>
            <return type-id='type-id-1749'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='start' mangled-name='_ZN2PJ20DataSourcePluginBase5startB5cxx11Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <return type-id='type-id-1749'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='7'>
          <function-decl name='stop' mangled-name='_ZN2PJ20DataSourcePluginBase4stopEv' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='8'>
          <function-decl name='pause' mangled-name='_ZN2PJ20DataSourcePluginBase5pauseB5cxx11Ev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase5pauseB5cxx11Ev'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <return type-id='type-id-1749'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='9'>
          <function-decl name='resume' mangled-name='_ZN2PJ20DataSourcePluginBase6resumeB5cxx11Ev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase6resumeB5cxx11Ev'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <return type-id='type-id-1749'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='10'>
          <function-decl name='poll' mangled-name='_ZN2PJ20DataSourcePluginBase4pollB5cxx11Ev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase4pollB5cxx11Ev'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <return type-id='type-id-1749'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='11'>
          <function-decl name='currentState' mangled-name='_ZNK2PJ20DataSourcePluginBase12currentStateEv' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-410' is-artificial='yes'/>
            <return type-id='type-id-1750'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='12'>
          <function-decl name='getDialog' mangled-name='_ZN2PJ20DataSourcePluginBase9getDialogEv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase9getDialogEv'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <return type-id='type-id-137'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='13'>
          <function-decl name='pluginExtension' mangled-name='_ZN2PJ20DataSourcePluginBase15pluginExtensionESt17basic_string_viewIcSt11char_traitsIcEE' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ20DataSourcePluginBase15pluginExtensionESt17basic_string_viewIcSt11char_traitsIcEE'>
            <parameter type-id='type-id-218' is-artificial='yes'/>
            <parameter type-id='type-id-1755'/>
            <return type-id='type-id-18'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='Span' type-id='type-id-1090' id='type-id-1756'/>
      <enum-decl name='PrimitiveType' id='type-id-1758'>
        <underlying-type type-id='type-id-43'/>
        <enumerator name='kFloat32' value='0'/>
        <enumerator name='kFloat64' value='1'/>
        <enumerator name='kInt8' value='2'/>
        <enumerator name='kInt16' value='3'/>
        <enumerator name='kInt32' value='4'/>
        <enumerator name='kInt64' value='5'/>
        <enumerator name='kUint8' value='6'/>
        <enumerator name='kUint16' value='7'/>
        <enumerator name='kUint32' value='8'/>
        <enumerator name='kUint64' value='9'/>
        <enumerator name='kBool' value='10'/>
        <enumerator name='kString' value='11'/>
        <enumerator name='kUnspecified' value='255'/>
      </enum-decl>
      <typedef-decl name='Timestamp' type-id='type-id-106' id='type-id-1759'/>
      <class-decl name='NullValue' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-274'/>
      <namespace-decl name='sdk'>
        <typedef-decl name='ArrowStreamHolder' type-id='type-id-300' id='type-id-282'/>
        <typedef-decl name='TopicHandle' type-id='type-id-120' id='type-id-1760'/>
        <typedef-decl name='FieldHandle' type-id='type-id-122' id='type-id-1761'/>
        <typedef-decl name='ObjectTopicHandle' type-id='type-id-124' id='type-id-1762'/>
        <class-decl name='TypedNull' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-297'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='type' type-id='type-id-1758' visibility='default'/>
          </data-member>
        </class-decl>
        <typedef-decl name='ValueRef' type-id='type-id-1108' id='type-id-493'/>
        <class-decl name='NamedFieldValue' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-472'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='name' type-id='type-id-1757' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='value' type-id='type-id-493' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='BoundFieldValue' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-469'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='field' type-id='type-id-1761' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='value' type-id='type-id-493' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='type' size-in-bits='8' is-struct='yes' naming-typedef-id='type-id-1552' visibility='default' id='type-id-1763'/>
        <class-decl name='type' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-1548' visibility='default' id='type-id-304'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='__out' type-id='type-id-322' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='SourceWriteHostView' size-in-bits='128' visibility='default' id='type-id-292'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='host_' type-id='type-id-159' visibility='default'/>
          </data-member>
          <member-function access='public' const='yes'>
            <function-decl name='appendRecord' mangled-name='_ZNK2PJ3sdk19SourceWriteHostView12appendRecordB5cxx11E17PJ_topic_handle_tlSt4spanIKNS0_15NamedFieldValueELm18446744073709551615EE' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK2PJ3sdk19SourceWriteHostView12appendRecordB5cxx11E17PJ_topic_handle_tlSt4spanIKNS0_15NamedFieldValueELm18446744073709551615EE'>
              <parameter type-id='type-id-489' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-1760' name='topic'/>
              <parameter type-id='type-id-1759' name='timestamp'/>
              <parameter type-id='type-id-1756' name='fields'/>
              <return type-id='type-id-1749'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='SourceObjectWriteHostView' size-in-bits='128' visibility='default' id='type-id-287'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='host_' type-id='type-id-170' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='ServiceRegistry' size-in-bits='128' visibility='default' id='type-id-284'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='raw_' type-id='type-id-134' visibility='default'/>
          </data-member>
          <member-function access='public' const='yes'>
            <function-decl name='require&lt;PJ::sdk::DataSourceRuntimeHostService&gt;' mangled-name='_ZNK2PJ3sdk15ServiceRegistry7requireINS0_28DataSourceRuntimeHostServiceEEENS_8ExpectedINT_4ViewENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEEv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK2PJ3sdk15ServiceRegistry7requireINS0_28DataSourceRuntimeHostServiceEEENS_8ExpectedINT_4ViewENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEEv'>
              <parameter type-id='type-id-480' name='this' is-artificial='yes'/>
              <return type-id='type-id-224'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='require&lt;PJ::sdk::SourceWriteHostService&gt;' mangled-name='_ZNK2PJ3sdk15ServiceRegistry7requireINS0_22SourceWriteHostServiceEEENS_8ExpectedINT_4ViewENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEEv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK2PJ3sdk15ServiceRegistry7requireINS0_22SourceWriteHostServiceEEENS_8ExpectedINT_4ViewENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEEv'>
              <parameter type-id='type-id-480' name='this' is-artificial='yes'/>
              <return type-id='type-id-233'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='SourceWriteHostService' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1764'>
          <member-type access='public'>
            <typedef-decl name='Raw' type-id='type-id-159' id='type-id-1765'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='View' type-id='type-id-292' id='type-id-1766'/>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='kMinVersion' type-id='type-id-1154' mangled-name='_ZN2PJ3sdk22SourceWriteHostService11kMinVersionE' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='SourceObjectWriteHostService' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1767'>
          <member-type access='public'>
            <typedef-decl name='Raw' type-id='type-id-170' id='type-id-1768'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='View' type-id='type-id-287' id='type-id-1769'/>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='kMinVersion' type-id='type-id-1154' mangled-name='_ZN2PJ3sdk28SourceObjectWriteHostService11kMinVersionE' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='DataSourceRuntimeHostService' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1770'>
          <member-type access='public'>
            <typedef-decl name='Raw' type-id='type-id-86' id='type-id-1771'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='View' type-id='type-id-219' id='type-id-1772'/>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='kMinVersion' type-id='type-id-1154' mangled-name='_ZN2PJ3sdk28DataSourceRuntimeHostService11kMinVersionE' visibility='default'/>
          </data-member>
        </class-decl>
        <namespace-decl name='detail'>
          <class-decl name='ArrowHolder&lt;ArrowArrayStream&gt;' size-in-bits='320' visibility='default' id='type-id-300'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='raw_' type-id='type-id-115' visibility='default'/>
            </data-member>
          </class-decl>
        </namespace-decl>
        <function-decl name='fillError' mangled-name='_ZN2PJ3sdk9fillErrorEP10PJ_error_tiSt17basic_string_viewIcSt11char_traitsIcEES6_' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ3sdk9fillErrorEP10PJ_error_tiSt17basic_string_viewIcSt11char_traitsIcEES6_'>
          <parameter type-id='type-id-306'/>
          <parameter type-id='type-id-128'/>
          <parameter type-id='type-id-1755'/>
          <parameter type-id='type-id-1755'/>
          <return type-id='type-id-48'/>
        </function-decl>
      </namespace-decl>
      <function-decl name='errorToString' mangled-name='_ZN2PJ13errorToStringB5cxx11ERK10PJ_error_t' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN2PJ13errorToStringB5cxx11ERK10PJ_error_t'>
        <parameter type-id='type-id-509'/>
        <return type-id='type-id-1757'/>
      </function-decl>
    </namespace-decl>
    <var-decl name='pj_plugin_abi_version' type-id='type-id-58' mangled-name='pj_plugin_abi_version' visibility='default' elf-symbol-id='pj_plugin_abi_version'/>
    <function-decl name='PJ_get_data_source_vtable' mangled-name='PJ_get_data_source_vtable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PJ_get_data_source_vtable'>
      <return type-id='type-id-505'/>
    </function-decl>
    <function-decl name='setlocale' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='localeconv' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1188'/>
    </function-decl>
    <function-decl name='remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rename' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='tmpfile' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='tmpnam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='fflush' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='freopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='setbuf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fgetc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='getc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='ungetc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fseek' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='ftell' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rewind' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='fgetpos' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-1181'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fsetpos' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-611'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='clearerr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='feof' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='perror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='strtod' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-406'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strtof' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-406'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='strtold' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-406'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtol' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-406'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='strtoul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-406'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strtoll' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-406'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='strtoull' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-406'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='atoi' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='atol' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atoll' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='rand' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='srand' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='atexit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1716'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='quick_exit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='system' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='qsort' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='div' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='ldiv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='lldiv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-181'/>
    </function-decl>
    <function-decl name='mblen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mbtowc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='strcoll' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='strxfrm' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='strtok' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='strerror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='wcscmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1171'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wcsncmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wcscoll' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1171'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wcsxfrm' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wcscspn' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1171'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wcsspn' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1171'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wcstok' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wcslen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wmemcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mbsinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-619'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mbrtowc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-1191'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='btowc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='wctob' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mbrlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-1191'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wcstod' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcstof' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='wcstold' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='wcstol' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='wcstoul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='wcstoll' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='wcstoull' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1748'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fwide' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-332'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fgetwc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='getwc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='getwchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='fputwc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='putwc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='putwchar' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='fputws' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='ungetwc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='wcsftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1153'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wctrans' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='towctrans' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='getchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fgets' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='bsearch' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='atof' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wctomb' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mbstowcs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wcstombs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wmemcpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wmemmove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wmemset' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wcscpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wcsncpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wcscat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wcsncat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='swprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-1171'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='vswprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1704'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fwprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-332'/>
      <parameter type-id='type-id-1171'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='vwprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1704'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='vfwprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-332'/>
      <parameter type-id='type-id-1171'/>
      <parameter type-id='type-id-1704'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fgetws' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-1747'/>
    </function-decl>
    <function-decl name='wcrtomb' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1191'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='mbsrtowcs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1747'/>
      <parameter type-id='type-id-603'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-1191'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wcsrtombs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-1172'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-1191'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='wctype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-214'/>
    </function-decl>
    <function-decl name='iswctype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <namespace-decl name='std'>
      <class-decl name='bad_any_cast' size-in-bits='64' visibility='default' id='type-id-1026'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1773'/>
        <member-function access='public' const='yes' vtable-offset='2'>
          <function-decl name='what' mangled-name='_ZNKSt12bad_any_cast4whatEv' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1028' is-artificial='yes'/>
            <return type-id='type-id-91'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PJ_named_field_value_t&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1774'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-1014' id='type-id-1020'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-148' id='type-id-1775'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-312' id='type-id-1776'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-18' id='type-id-1777'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1778'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1014' id='type-id-1779'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1780'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-1017' id='type-id-1023'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-2' id='type-id-1781'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-174' id='type-id-1782'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-91' id='type-id-1783'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-18' id='type-id-1784'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1785'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1017' id='type-id-1786'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;PJ_named_field_value_t&gt;' size-in-bits='8' visibility='default' id='type-id-1014'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-374'/>
      </class-decl>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' id='type-id-1017'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-377'/>
      </class-decl>
      <class-decl name='char_traits&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1787'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-2' id='type-id-1045'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-21' id='type-id-1049'/>
        </member-type>
      </class-decl>
      <class-decl name='__false_type' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1788'/>
      <class-decl name='_Enable_default_constructor_tag' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1221'/>
      <class-decl name='_Enable_default_constructor&lt;true, std::variant&lt;PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-626'/>
      <class-decl name='_Enable_default_constructor&lt;true, std::variant&lt;PJ::NullValue, PJ::sdk::TypedNull, float, double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-629'/>
      <class-decl name='_Enable_default_constructor&lt;true, std::variant&lt;PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-632'/>
      <class-decl name='_Enable_default_constructor&lt;true, std::variant&lt;PJ_field_handle_t, PJ::Expected&lt;PJ_field_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-635'/>
      <class-decl name='_Enable_default_constructor&lt;true, std::variant&lt;PJ_object_topic_handle_t, PJ::Expected&lt;PJ_object_topic_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-638'/>
      <class-decl name='_Enable_default_constructor&lt;true, std::variant&lt;PJ_parser_binding_handle_t, PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-641'/>
      <class-decl name='_Enable_default_constructor&lt;true, std::variant&lt;PJ_topic_handle_t, PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-644'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::optional&lt;PJ::sdk::SourceObjectWriteHostView&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1789'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::variant&lt;PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1790'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::variant&lt;PJ::NullValue, PJ::sdk::TypedNull, float, double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1791'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::variant&lt;PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1792'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::variant&lt;PJ_field_handle_t, PJ::Expected&lt;PJ_field_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1793'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::variant&lt;PJ_object_topic_handle_t, PJ::Expected&lt;PJ_object_topic_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1794'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::variant&lt;PJ_parser_binding_handle_t, PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1795'/>
      <class-decl name='_Enable_copy_move&lt;true, true, true, true, std::variant&lt;PJ_topic_handle_t, PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1796'/>
      <typedef-decl name='__make_not_void' type-id='type-id-1797' id='type-id-1460'/>
      <class-decl name='pointer_traits&lt;char const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1798'>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-91' id='type-id-1799'/>
        </member-type>
      </class-decl>
      <class-decl name='pointer_traits&lt;char*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1800'>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-174' id='type-id-1801'/>
        </member-type>
      </class-decl>
      <class-decl name='__copy_move&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1802'/>
      <class-decl name='__copy_move&lt;false, true, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1803'/>
      <class-decl name='_Destroy_aux&lt;false&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1804'/>
      <class-decl name='_Destroy_aux&lt;true&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1805'/>
      <class-decl name='binary_function&lt;char const*, char const*, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1806'/>
      <class-decl name='less&lt;char const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1080'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1806'/>
      </class-decl>
      <class-decl name='input_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1807'/>
      <class-decl name='forward_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1808'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1807'/>
      </class-decl>
      <class-decl name='bidirectional_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1809'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1808'/>
      </class-decl>
      <class-decl name='random_access_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1810'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1809'/>
      </class-decl>
      <class-decl name='iterator_traits&lt;PJ_named_field_value_t*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1811'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1813' id='type-id-1812'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-312' id='type-id-1814'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-310' id='type-id-1815'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;char const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1816'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1813' id='type-id-1817'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-91' id='type-id-1818'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-598' id='type-id-1819'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;char*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1820'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1813' id='type-id-1821'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-174' id='type-id-1822'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-403' id='type-id-1823'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;const PJ::sdk::NamedFieldValue*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1824'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1813' id='type-id-1825'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-475' id='type-id-1826'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-474' id='type-id-1827'/>
        </member-type>
      </class-decl>
      <class-decl name='_Vector_base&lt;PJ_named_field_value_t, std::allocator&lt;PJ_named_field_value_t&gt; &gt;' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-658'>
        <member-type access='public'>
          <typedef-decl name='_Tp_alloc_type' type-id='type-id-1828' id='type-id-662'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1830' id='type-id-1829'/>
        </member-type>
        <member-type access='public'>
          <class-decl name='_Vector_impl_data' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-665'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_start' type-id='type-id-1829' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_finish' type-id='type-id-1829' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_end_of_storage' type-id='type-id-1829' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <class-decl name='_Vector_impl' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-1243'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1014'/>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-665'/>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-1014' id='type-id-668'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-1243' visibility='default'/>
        </data-member>
        <member-function access='public' destructor='yes'>
          <function-decl name='~_Vector_base' mangled-name='_ZNSt12_Vector_baseI22PJ_named_field_value_tSaIS0_EED2Ev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt12_Vector_baseI22PJ_named_field_value_tSaIS0_EED2Ev'>
            <parameter type-id='type-id-1240' name='this' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='vector&lt;PJ_named_field_value_t, std::allocator&lt;PJ_named_field_value_t&gt; &gt;' size-in-bits='192' visibility='default' id='type-id-1136'>
        <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-658'/>
        <member-type access='private'>
          <typedef-decl name='_Tp_alloc_type' type-id='type-id-662' id='type-id-1141'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-148' id='type-id-1149'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1829' id='type-id-1831'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1833' id='type-id-1832'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-1835' id='type-id-1834'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-357' id='type-id-1836'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-1838' id='type-id-1837'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1840' id='type-id-1839'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1842' id='type-id-1841'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1147'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-1014' id='type-id-1144'/>
        </member-type>
        <member-function access='protected'>
          <function-decl name='_M_realloc_insert&lt;PJ_named_field_value_t&gt;' mangled-name='_ZNSt6vectorI22PJ_named_field_value_tSaIS0_EE17_M_realloc_insertIJS0_EEEvN9__gnu_cxx17__normal_iteratorIPS0_S2_EEDpOT_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt6vectorI22PJ_named_field_value_tSaIS0_EE17_M_realloc_insertIJS0_EEEvN9__gnu_cxx17__normal_iteratorIPS0_S2_EEDpOT_'>
            <parameter type-id='type-id-1699' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1836' name='__position'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='string' type-id='type-id-671' id='type-id-1757'/>
      <class-decl name='initializer_list&lt;PJ::sdk::BoundFieldValue&gt;' size-in-bits='128' visibility='default' id='type-id-1055'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1843'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-471' id='type-id-1844'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-471' id='type-id-1845'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1844' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1843' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;PJ::sdk::NamedFieldValue&gt;' size-in-bits='128' visibility='default' id='type-id-1058'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1846'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-475' id='type-id-1847'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-475' id='type-id-1848'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1847' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1846' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;PJ_named_field_value_t&gt;' size-in-bits='128' visibility='default' id='type-id-1062'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1849'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-515' id='type-id-1850'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-515' id='type-id-1851'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1850' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1849' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;char&gt;' size-in-bits='128' visibility='default' id='type-id-1065'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1852'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-91' id='type-id-1853'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-91' id='type-id-1854'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1853' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1852' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='nullopt_t' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1515'>
        <member-type access='public'>
          <enum-decl name='_Construct' id='type-id-1855'>
            <underlying-type type-id='type-id-42'/>
            <enumerator name='_Token' value='0'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='bad_optional_access' size-in-bits='64' visibility='default' id='type-id-1029'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1052'/>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~bad_optional_access' mangled-name='_ZNSt19bad_optional_accessD4Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1471' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='2'>
          <function-decl name='what' mangled-name='_ZNKSt19bad_optional_access4whatEv' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1031' is-artificial='yes'/>
            <return type-id='type-id-91'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Optional_payload_base&lt;PJ::sdk::SourceObjectWriteHostView&gt;' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-654'>
        <member-type access='public'>
          <class-decl name='_Empty_byte' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1856'/>
        </member-type>
        <member-type access='public'>
          <union-decl name='_Storage&lt;PJ::sdk::SourceObjectWriteHostView, true&gt;' size-in-bits='128' visibility='default' id='type-id-1236'>
            <data-member access='public'>
              <var-decl name='_M_empty' type-id='type-id-1856' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='_M_value' type-id='type-id-287' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_payload' type-id='type-id-1236' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_engaged' type-id='type-id-1' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='_Optional_payload&lt;PJ::sdk::SourceObjectWriteHostView, true, true, true&gt;' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-1229'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-654'/>
      </class-decl>
      <class-decl name='_Optional_base_impl&lt;PJ::sdk::SourceObjectWriteHostView, std::_Optional_base&lt;PJ::sdk::SourceObjectWriteHostView, true, true&gt; &gt;' size-in-bits='8' visibility='default' id='type-id-650'/>
      <class-decl name='_Optional_base&lt;PJ::sdk::SourceObjectWriteHostView, true, true&gt;' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-647'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-650'/>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_payload' type-id='type-id-1229' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='optional&lt;PJ::sdk::SourceObjectWriteHostView&gt;' size-in-bits='192' visibility='default' id='type-id-1084'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-647'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1789'/>
      </class-decl>
      <class-decl name='span&lt;const PJ::sdk::NamedFieldValue, 18446744073709551615&gt;' size-in-bits='128' visibility='default' id='type-id-1090'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-473' id='type-id-1662'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1857'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-475' id='type-id-1858'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1663' id='type-id-1859'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-367' id='type-id-1860'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1862' id='type-id-1861'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='extent' type-id='type-id-1089' mangled-name='_ZNSt4spanIKN2PJ3sdk15NamedFieldValueELm18446744073709551615EE6extentE' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_ptr' type-id='type-id-1858' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_extent' type-id='type-id-681' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='span&lt;unsigned char const, 18446744073709551615&gt;' size-in-bits='128' visibility='default' id='type-id-1095'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1157' id='type-id-1667'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1863'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1160' id='type-id-1864'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1668' id='type-id-1865'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-1867' id='type-id-1866'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1869' id='type-id-1868'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='extent' type-id='type-id-1089' mangled-name='_ZNSt4spanIKhLm18446744073709551615EE6extentE' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_ptr' type-id='type-id-1864' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_extent' type-id='type-id-681' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt;' size-in-bits='128' visibility='default' id='type-id-1035'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-2' id='type-id-1041'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-1044' id='type-id-1870'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-1043' id='type-id-1871'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-1044' id='type-id-1872'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1874' id='type-id-1873'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1088' id='type-id-1875'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-1088' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-91' visibility='default'/>
        </data-member>
      </class-decl>
      <typedef-decl name='string_view' type-id='type-id-1035' id='type-id-1755'/>
      <class-decl name='integral_constant&lt;bool, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1068'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1' id='type-id-1876'/>
        </member-type>
      </class-decl>
      <class-decl name='integral_constant&lt;bool, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1071'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1' id='type-id-1877'/>
        </member-type>
      </class-decl>
      <class-decl name='integral_constant&lt;unsigned char, 14&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1074'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-44' id='type-id-1878'/>
        </member-type>
      </class-decl>
      <class-decl name='integral_constant&lt;unsigned char, 2&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1077'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-44' id='type-id-1879'/>
        </member-type>
      </class-decl>
      <typedef-decl name='true_type' type-id='type-id-1071' id='type-id-1880'/>
      <typedef-decl name='false_type' type-id='type-id-1068' id='type-id-1881'/>
      <class-decl name='__success_type&lt;PJ::PrimitiveType&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1882'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1758' id='type-id-1883'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::DataSourceRuntimeHostView&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1884'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-219' id='type-id-1523'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::sdk::SourceObjectWriteHostView&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1885'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-287' id='type-id-1541'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::sdk::SourceWriteHostView&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1886'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-292' id='type-id-1546'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::sdk::toAbiScalar(const ValueRef&amp;)::&lt;lambda(auto:44&amp;&amp;)&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1887'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-304' id='type-id-1548'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::sdk::typeOf(const ValueRef&amp;)::&lt;lambda(auto:43&amp;&amp;)&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1888'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1763' id='type-id-1552'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ_named_field_value_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1889'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-148' id='type-id-1558'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ_parser_binding_handle_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1890'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-56' id='type-id-1563'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ_topic_handle_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1891'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-120' id='type-id-1568'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1892'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-671' id='type-id-1624'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1893'/>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1894'/>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ_parser_binding_handle_t, PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1895'/>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ_topic_handle_t, PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1896'/>
      <class-decl name='remove_reference&lt;PJ::DataSourceRuntimeHostView&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1897'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-219' id='type-id-1520'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1898'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-224' id='type-id-1525'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1899'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-228' id='type-id-1527'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1900'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-233' id='type-id-1529'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1901'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-237' id='type-id-1531'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1902'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-257' id='type-id-1533'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1903'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-265' id='type-id-1535'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Expected&lt;void, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1904'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-270' id='type-id-1537'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::Unexpected&lt;std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1905'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-277' id='type-id-1539'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::sdk::SourceWriteHostView&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1906'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-292' id='type-id-1543'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ_named_field_value_t&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1907'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-148' id='type-id-1556'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ_parser_binding_handle_t&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1908'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-56' id='type-id-1560'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ_topic_handle_t&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1909'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-120' id='type-id-1565'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;bool const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1910'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-594' id='type-id-1570'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const PJ::NullValue&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1911'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-460' id='type-id-1572'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const PJ::sdk::TypedNull&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1912'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-490' id='type-id-1574'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;PJ::NullValue, PJ::sdk::TypedNull, float, double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1913'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-910' id='type-id-1576'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;PJ::sdk::TypedNull, float, double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1914'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-913' id='type-id-1578'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1915'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-916' id='type-id-1580'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1916'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-919' id='type-id-1582'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;float, double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1917'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-922' id='type-id-1584'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1918'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-925' id='type-id-1586'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1919'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-928' id='type-id-1588'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1920'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-931' id='type-id-1590'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1921'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-934' id='type-id-1592'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1922'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-937' id='type-id-1594'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1923'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-940' id='type-id-1596'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1924'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-943' id='type-id-1598'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1925'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-946' id='type-id-1600'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::__detail::__variant::_Variadic_union&lt;unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1926'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-949' id='type-id-1602'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1927'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1036' id='type-id-1604'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;const std::variant&lt;PJ::NullValue, PJ::sdk::TypedNull, float, double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1928'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1109' id='type-id-1606'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;double const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1929'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-604' id='type-id-1608'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;float const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1930'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-607' id='type-id-1610'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;int const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1931'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-612' id='type-id-1612'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;long int const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1932'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-615' id='type-id-1614'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;long unsigned int const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1933'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1164' id='type-id-1616'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;short int const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1934'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-620' id='type-id-1618'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;short unsigned int const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1935'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1167' id='type-id-1620'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;signed char const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1936'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-623' id='type-id-1622'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1937'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-671' id='type-id-1626'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1938'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1371' id='type-id-1629'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1939'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1374' id='type-id-1631'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1940'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1377' id='type-id-1633'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1941'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1384' id='type-id-1635'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1942'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1387' id='type-id-1637'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1943'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1391' id='type-id-1639'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ_parser_binding_handle_t, PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1944'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1399' id='type-id-1641'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variadic_union&lt;PJ_topic_handle_t, PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1945'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1402' id='type-id-1643'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::allocator&lt;char&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1946'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1017' id='type-id-1645'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::variant&lt;PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1947'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1103' id='type-id-1647'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::variant&lt;PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1948'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1113' id='type-id-1649'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::variant&lt;PJ_parser_binding_handle_t, PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1949'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1126' id='type-id-1651'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::variant&lt;PJ_topic_handle_t, PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1950'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1131' id='type-id-1653'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;unsigned char const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1951'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1157' id='type-id-1655'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;unsigned int const&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1952'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1161' id='type-id-1657'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::sdk::toAbiScalar(const ValueRef&amp;)::&lt;lambda(auto:44&amp;&amp;)&gt;&amp;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1953'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-304' id='type-id-1550'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;PJ::sdk::typeOf(const ValueRef&amp;)::&lt;lambda(auto:43&amp;&amp;)&gt;&amp;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1954'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-1763' id='type-id-1554'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt;&amp;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1955'/>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt;&amp;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1956'/>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ_parser_binding_handle_t, PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt;&amp;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1957'/>
      <class-decl name='remove_reference&lt;std::__detail::__variant::_Variant_storage&lt;false, PJ_topic_handle_t, PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt;::_M_reset()::&lt;lambda(auto:11&amp;&amp;)&gt;&amp;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1958'/>
      <class-decl name='enable_if&lt;true, PJ_named_field_value_t*&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1959'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-312' id='type-id-1960'/>
        </member-type>
      </class-decl>
      <typedef-decl name='__enable_if_t' type-id='type-id-1960' id='type-id-1961'/>
      <class-decl name='conditional&lt;false, std::__undefined, char const&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1962'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-597' id='type-id-1797'/>
        </member-type>
      </class-decl>
      <class-decl name='conditional&lt;false, std::__undefined, char&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1963'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-2' id='type-id-1964'/>
        </member-type>
      </class-decl>
      <class-decl name='__invoke_other' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1965'/>
      <typedef-decl name='invoke_result_t' type-id='type-id-1883' id='type-id-1966'/>
      <class-decl name='in_place_t' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1509'/>
      <class-decl name='in_place_index_t&lt;0&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1481'/>
      <class-decl name='in_place_index_t&lt;10&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1483'/>
      <class-decl name='in_place_index_t&lt;11&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1485'/>
      <class-decl name='in_place_index_t&lt;12&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1487'/>
      <class-decl name='in_place_index_t&lt;13&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1489'/>
      <class-decl name='in_place_index_t&lt;1&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1491'/>
      <class-decl name='in_place_index_t&lt;2&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1493'/>
      <class-decl name='in_place_index_t&lt;3&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1495'/>
      <class-decl name='in_place_index_t&lt;4&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1497'/>
      <class-decl name='in_place_index_t&lt;5&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1499'/>
      <class-decl name='in_place_index_t&lt;6&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1501'/>
      <class-decl name='in_place_index_t&lt;7&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1503'/>
      <class-decl name='in_place_index_t&lt;8&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1505'/>
      <class-decl name='in_place_index_t&lt;9&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1507'/>
      <class-decl name='variant_alternative&lt;0, std::variant&lt;PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1967'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-219' id='type-id-1968'/>
        </member-type>
      </class-decl>
      <class-decl name='variant_alternative&lt;0, std::variant&lt;PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1969'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-257' id='type-id-1970'/>
        </member-type>
      </class-decl>
      <class-decl name='variant_alternative&lt;0, std::variant&lt;PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1971'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-265' id='type-id-1972'/>
        </member-type>
      </class-decl>
      <class-decl name='variant_alternative&lt;0, std::variant&lt;PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='type-id-1973'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-292' id='type-id-1974'/>
        </member-type>
      </class-decl>
      <typedef-decl name='variant_alternative_t' type-id='type-id-1970' id='type-id-1694'/>
      <class-decl name='bad_variant_access' size-in-bits='128' visibility='default' id='type-id-1032'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1052'/>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_reason' type-id='type-id-91' visibility='default'/>
        </data-member>
        <member-function access='public' const='yes' vtable-offset='2'>
          <function-decl name='what' mangled-name='_ZNKSt18bad_variant_access4whatEv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt18bad_variant_access4whatEv'>
            <parameter type-id='type-id-1034' is-artificial='yes'/>
            <return type-id='type-id-91'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='variant&lt;PJ::DataSourceRuntimeHostView, PJ::Expected&lt;PJ::DataSourceRuntimeHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;' size-in-bits='320' visibility='default' id='type-id-1103'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-951'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-626'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1790'/>
      </class-decl>
      <class-decl name='variant&lt;PJ::NullValue, PJ::sdk::TypedNull, float, double, signed char, short int, int, long int, unsigned char, short unsigned int, unsigned int, long unsigned int, bool, std::basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt; &gt;' size-in-bits='192' visibility='default' id='type-id-1108'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-954'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-629'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1791'/>
      </class-decl>
      <class-decl name='variant&lt;PJ::sdk::SourceWriteHostView, PJ::Expected&lt;PJ::sdk::SourceWriteHostView, std::__cxx11::basic_string&lt;char&gt; &gt;::ErrorStorage&gt;' size-in-bits='320' visibility='default' id='type-id-1113'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-957'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-632'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1792'/>
      </class-decl>
      <class-decl name='variant&lt;PJ_field_handle_t, PJ::Expected&lt;PJ_field_handle_t&gt;::ErrorStorage&gt;' size-in-bits='320' visibility='default' id='type-id-1118'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-960'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-635'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1793'/>
      </class-decl>
      <class-decl name='variant&lt;PJ_object_topic_handle_t, PJ::Expected&lt;PJ_object_topic_handle_t&gt;::ErrorStorage&gt;' size-in-bits='320' visibility='default' id='type-id-1122'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-963'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-638'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1794'/>
      </class-decl>
      <class-decl name='variant&lt;PJ_parser_binding_handle_t, PJ::Expected&lt;PJ_parser_binding_handle_t&gt;::ErrorStorage&gt;' size-in-bits='320' visibility='default' id='type-id-1126'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-966'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-641'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1795'/>
      </class-decl>
      <class-decl name='variant&lt;PJ_topic_handle_t, PJ::Expected&lt;PJ_topic_handle_t&gt;::ErrorStorage&gt;' size-in-bits='320' visibility='default' id='type-id-1131'>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-969'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-644'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-1796'/>
      </class-decl>
      <typedef-decl name='size_t' type-id='type-id-4' id='type-id-1088'/>
      <typedef-decl name='ptrdiff_t' type-id='type-id-23' id='type-id-1813'/>
      <class-decl name='bad_cast' visibility='default' is-declaration-only='yes' id='type-id-1773'/>
      <class-decl name='exception' visibility='default' is-declaration-only='yes' id='type-id-1052'>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~exception' mangled-name='_ZNSt9exceptionD0Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1480' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~exception' mangled-name='_ZNSt9exceptionD1Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1480' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~exception' mangled-name='_ZNSt9exceptionD2Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1480' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~exception' mangled-name='_ZNSt9exceptionD4Ev' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1480' is-artificial='yes'/>
            <parameter type-id='type-id-21' is-artificial='yes'/>
            <return type-id='type-id-48'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='2'>
          <function-decl name='what' mangled-name='_ZNKSt9exception4whatEv' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1054' is-artificial='yes'/>
            <return type-id='type-id-91'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;PJ_named_field_value_t*, std::vector&lt;PJ_named_field_value_t, std::allocator&lt;PJ_named_field_value_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1842'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1975'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1976'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;const PJ::sdk::NamedFieldValue*, std::span&lt;const PJ::sdk::NamedFieldValue, 18446744073709551615&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1862'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;const PJ_named_field_value_t*, std::vector&lt;PJ_named_field_value_t, std::allocator&lt;PJ_named_field_value_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1840'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;unsigned char const*, std::span&lt;unsigned char const, 18446744073709551615&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1869'/>
      <class-decl name='reverse_iterator&lt;char const*&gt;' visibility='default' is-declaration-only='yes' id='type-id-1874'/>
      <class-decl name='type_info' visibility='default' is-declaration-only='yes' id='type-id-1100'/>
